{"talks": [{"code": "HQCCYH", "id": 1969, "title": "38C3: Opening Ceremony", "abstract": "Glad you could make it! Take a seat and buckle up for a ride through four days of chaotic adventures.", "speakers": ["GLM7BA", "SB9MER"], "track": 2, "start": "2024-12-27T10:30:00+01:00", "end": "2024-12-27T11:00:00+01:00", "room": 1, "duration": 30, "updated": "2024-12-22T10:54:37.582606+00:00", "state": null, "do_not_record": false}, {"code": "8ZPHSP", "id": 1971, "title": "Correctiv-Recherche \"Geheimplan gegen Deutschland\" – 1 Jahr danach", "abstract": "Vor einem Jahr veröffentlichte Correctiv die Recherche “Geheimplan gegen Deutschland”, die ein geheimes Treffen von Rechtsextremen, AfD-Funktionären und CDU-Mitgliedern enthüllte. Diese Enthüllung führte zu massiven Demonstrationen, während rechtsextreme Gruppen versuchten, das Geschehen zu relativieren. Die politische Reaktion blieb jedoch verhalten, und die AfD setzte die demokratischen Parteien weiter unter Druck. In diesem Vortrag gibt Jean Peters, leitender Reporter der Recherche, einen Überblick über die Recherchemethoden, analysiert den medialen Diskurs und zeigt zukünftige Perspektiven zur Berichterstattung über Rechtsextremismus auf.", "speakers": ["AMFQL7"], "track": 7, "start": "2024-12-27T11:00:00+01:00", "end": "2024-12-27T11:40:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.582663+00:00", "state": null, "do_not_record": false}, {"code": "FQESP3", "id": 1970, "title": "Typing Culture with Keyboard: Okinawa - Reviving the Japanese Ryukyu-Language through the Art and Precision of Digital Input", "abstract": "In a world dominated by digital communication and the drive toward linguistic unification, the simple act of 'typing' varies significantly across languages and writing systems. For European languages like English and German, typing typically involves a set of about 100 letters and symbols. In contrast, Japanese—and by extension, Okinawan—requires three distinct scripts: hiragana, katakana, and kanji. Each of these adds layers of complexity and cultural depth to written expression.\r\n\r\nThis presentation delves into the development of an input method engine (IME) for Okinawan, an endangered language spoken in Japan's Ryukyuan archipelago. Moving beyond technical challenges, this project reveals how modern digital ‘calligraphy’ intersects with language preservation. Every keystroke becomes a deliberate cultural choice, as the IME reflects the aesthetic and linguistic essence of Okinawan language.\r\n\r\nHighlighting linguistic expression, cultural significance, and the urgent need for language preservation, this talk presents a model for future digital tools that empower endangered languages and cultures to thrive in the digital realm.", "speakers": ["L9VTYA"], "track": 1, "start": "2024-12-27T11:00:00+01:00", "end": "2024-12-27T11:40:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.582643+00:00", "state": null, "do_not_record": false}, {"code": "QSC7YF", "id": 1972, "title": "libobscura: Cameras are difficult", "abstract": "I'm not big-brained enough to use cameras on Linux, so I decided to write my own camera stack (based on a real story).", "speakers": ["GATV3V"], "track": 4, "start": "2024-12-27T11:00:00+01:00", "end": "2024-12-27T11:40:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.582682+00:00", "state": null, "do_not_record": false}, {"code": "MJYTSS", "id": 1973, "title": "Police 2.0: Peaceful activism is terrorism and fakenews are facts", "abstract": "On 23 October 2019 peaceful activist Frank van der Linde found out the Dutch Police was associating him with terrorism to other countries' law enforcement.\r\n \r\nThis talk goes over the bizarre, worrying and, frankly, quite funny journey that Frank van der Linde has embarked on, hoping on a litigation frenzy to seek justice and fight back against the institutional intimidation of activists.", "speakers": ["97WZA7", "YPVSCL"], "track": 7, "start": "2024-12-27T12:00:00+01:00", "end": "2024-12-27T12:40:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.582700+00:00", "state": null, "do_not_record": false}, {"code": "SJ8PGD", "id": 1974, "title": "\"Natürlich bin ich 18!\" - Altersprüfungen im Netz aus Datenschutzperspektive", "abstract": "„Um nach diesem Begriff zu suchen, dich auf dieser Website anzumelden oder dieses Video anzuschauen, halte bitte deinen Personalausweis bereit, damit wir dein Alter überprüfen können.“\r\n\r\nSolche Aufforderungen könnten uns in Zukunft häufiger begegnen, denn immer mehr Websites wollen unser Alter wissen. Doch woher kommt dieses Interesse und ist das eigentlich zulässig? Gemeinsam setzen wir die Datenschutzbrille auf und gehen folgenden Fragen auf den Grund: Welche Methoden der Altersprüfung gibt es und wie funktionieren sie? Können oder sollten Methoden der Altersprüfungen eingesetzt werden und gibt es Fälle, in denen sie sogar eingesetzt werden müssen? Sind Datenschutz und Kinderschutz tatsächlich Gegensätze oder haben sie doch mehr gemeinsam, als oft vermutet wird? Und was sagt eigentlich die Bundesbeauftragte für den Datenschutz und die Informationsfreiheit (BfDI) dazu?", "speakers": ["XGHZ8X", "MU3XPH"], "track": 7, "start": "2024-12-27T12:00:00+01:00", "end": "2024-12-27T12:40:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.582719+00:00", "state": null, "do_not_record": false}, {"code": "RUBQ88", "id": 1975, "title": "ACE up the sleeve: Hacking into Apple's new USB-C Controller", "abstract": "With the iPhone 15 & iPhone 15 Pro, Apple switched their iPhone to USB-C and introduced a new USB-C controller: The ACE3, a powerful, very custom, TI manufactured chip.\r\n\r\nBut the ACE3 does more than just handle USB power delivery: It's a full microcontroller running a full USB stack connected to some of the internal busses of the device, and is responsible for providing access to JTAG of the application processor, the internal SPMI bus, etc.\r\n\r\nWe start by investigating the previous variant of the ACE3: The ACE2. It's based on a known chip, and using a combination of a hardware vulnerability in MacBooks and a custom macOS kernel module we managed to persistently backdoor it - even surviving full-system restores.\r\n\r\nOn the ACE3 however, Apple upped their game: Firmware updates are personalized to the device, debug interfaces seem to be disabled, and the external flash is validated and does not contain all the firmware. However using a combination of reverse-engineering, RF side-channel analysis and electro-magnetic fault-injection it was possible to gain code-execution on the ACE3 - allowing dumping of the ROM, and analysis of the functionality.\r\n\r\nThis talk will show how to use a combination of hardware, firmware, reverse-engineering, side-channel analysis and fault-injection to gain code-execution on a completely custom chip, enabling further security research on an under-explored but security relevant part of Apple devices. It will also demonstrate attacks on the predecessor of the ACE3.", "speakers": ["GSQXZS"], "track": 6, "start": "2024-12-27T12:00:00+01:00", "end": "2024-12-27T12:40:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.582739+00:00", "state": null, "do_not_record": false}, {"code": "FSZBSE", "id": 1978, "title": "Die Geschlechter denen die sie hacken: Selbstbestimmungsgesetz, Pinke Listen, Überwachungsstaat", "abstract": "Selbstbestimmung ein grundlegendes Prinzip des Hacken, ob technologisch oder geschlechtlich. Doch was wenn Selbstbestimmung nur bedingt umsetzbar ist- im besten Fall und mit staatlicher Repression als Standard?\r\nSelbstbestimmung selbst gemacht ist eine trans, inter, nonbinäre Aktionsgruppe deren Name Programm ist. Wir wollen das System hacken um wir selbst zu sein, Überwachungsfrei und mit (Kranken)Versicherung.Ob mögliche Informationsweitergabe/Offenbarungsgebot, für alle Menschen, ob Cis oder TIN*, das in letzter Minute für die Bezahlkarte aus dem mangelhaften „Selbstbestimmungs“Gesetz (SBSG) genommen wurde oder die Sabotage und Unmöglichmachung von geschlechtaffirmierender Gesundheitsversorgung- wir stehen wie migrantische Menschen im Mittelpunkt von staatlicher Überwachungsliebe und faschistischer Auslöschungsfantasien, jedoch unbeachtet im Chaos.\r\nWir wollen dies ändern- hier, dieses Jahr und für alle Zeit. Wir werden den Prozess des SBSG ergründen, den Zusammenhang von (Un)Sicherheitspaket, Überwachungsmaßnahmen und Transsein herstellen wie auch ganz nebenbei illegalisierte Praktiken versichern, durch die Geschlechts-zusatzversicherung. Nur eure Bühne wird gebraucht und die Tastaturen unser aller Geschwister.", "speakers": ["MD7VMQ", "VCSD3Y", "GJAZWP"], "track": 7, "start": "2024-12-27T12:55:00+01:00", "end": "2024-12-27T13:35:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.582792+00:00", "state": null, "do_not_record": false}, {"code": "C38ZK7", "id": 1977, "title": "Liberating Wi-Fi on the ESP32", "abstract": "Reverse engineering the Wi-Fi peripheral of the ESP32 to build an open source Wi-Fi stack.", "speakers": ["8W79RK", "VEYXPB"], "track": 4, "start": "2024-12-27T12:55:00+01:00", "end": "2024-12-27T13:35:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.582774+00:00", "state": null, "do_not_record": false}, {"code": "7L7TBY", "id": 1976, "title": "Transparency? Not from the European Commission", "abstract": "The European Commission is the executive branch of the European Union with the duty to uphold the law. The transparency of the Commission´s actions and decisions range from questionable to abysmal. Attempts by the public to access information are often thwarted. This talk will cover the Commission´s lack of transparency, challenges faced by the public in accessing information, Commission´s tactics and examples of the European Ombudsman´s interventions to improve the situation. Whether you are interested in ChatControl, AI or public procurement, this talk will have you covered.", "speakers": ["88EWDM"], "track": 7, "start": "2024-12-27T12:55:00+01:00", "end": "2024-12-27T13:35:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.582757+00:00", "state": null, "do_not_record": false}, {"code": "7KYFDQ", "id": 1981, "title": "Life in the Lager: How it is & how to support", "abstract": "Was ist ein Lager und warum ist es so schrecklich und unmenschlich? Wir werden einen Überblick über betroffene Perspektiven mit Selbst­erfahrungen geben, wie man in Lagern (Wohnheimen, EAE) lebt.\r\n\r\nWir geben einen Überblick über die rassistische Bezahlkarte, sowie die Einschränkung der Freiheit wie schwer ist und über das Leben von Jugendliche in Lagern.\r\nWas machen wir? Wie können wir unterstützen und worauf sollte man achten?", "speakers": ["VSZDUH"], "track": 7, "start": "2024-12-27T13:50:00+01:00", "end": "2024-12-27T14:30:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.582843+00:00", "state": null, "do_not_record": true}, {"code": "XNB7SG", "id": 1980, "title": "Clay PCB", "abstract": "We built an Ethical Hardware Kit with a PCB microcontroller made of wild clay retrieved from the forest in Austria and fired on a bonfire. Our conductive tracks use urban-mined silver and all components are re-used from old electronic devices. The microcontroller can compute different inputs and outputs and is totally open source.", "speakers": ["BU8FCC", "Z7NCVT"], "track": 1, "start": "2024-12-27T13:50:00+01:00", "end": "2024-12-27T14:30:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.582826+00:00", "state": null, "do_not_record": false}, {"code": "7GVNYD", "id": 1979, "title": "Was lange währt, wird endlich gut? Die Modernisierung des Computerstrafrechts", "abstract": "Die Reform des Computerstrafrechts ist längst überfällig. Die bestehende Gesetzgebung ist zunehmend veraltet und entspricht nicht mehr den Anforderungen unserer digitalen Welt. Spätestens seit der Veröffentlichung des aktuellen Koalitionsvertrags hat sich die Bundesregierung die Modernisierung dieses vielfach kritisierten Rechtsbereichs auf die Fahnen geschrieben. Doch was ist seitdem wirklich passiert? Wie sieht der aktuelle Stand der Reformbemühung aus? Was wird sich konkret ändern und welche Auswirkungen wird dies auf die Hacker-Community und die Sicherheitsforschung haben? Und wird das endlich gut?", "speakers": ["7STKW8", "MDQNUH"], "track": 7, "start": "2024-12-27T13:50:00+01:00", "end": "2024-12-27T14:30:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.582809+00:00", "state": null, "do_not_record": false}, {"code": "SRXRMA", "id": 1983, "title": "„Konnte bisher noch nie gehackt werden“: Die elektronische Patientenakte kommt - jetzt für alle!", "abstract": "In wenigen Wochen werden die Gesundheitsdaten von rund 73 Millionen in Deutschland Krankenversicherten ohne deren Zutun über Praxis- und Krankenhausgrenzen hinweg zentral in einer Akte zusammengeführt - in der [„elektronischen Patientenakte für alle“](https://www.bundesgesundheitsministerium.de/themen/digitalisierung/elektronische-patientenakte/epa-fuer-alle.html).\r\n\r\nFortsetzung von 36C3 - [„Hacker hin oder her“: Die elektronische Patientenakte kommt!](https://media.ccc.de/v/36c3-10595-hacker_hin_oder_her_die_elektronische_patientenakte_kommt)", "speakers": ["QZDXQZ", "MHLNJ7"], "track": 6, "start": "2024-12-27T14:45:00+01:00", "end": "2024-12-27T15:45:00+01:00", "room": 1, "duration": 60, "updated": "2024-12-23T17:21:56.092263+00:00", "state": null, "do_not_record": false}, {"code": "KETTLY", "id": 1984, "title": "Breaking NATO Radio Encryption", "abstract": "We present fatal security flaws in the HALFLOOP-24 encryption algorithm, which is used by the US military and NATO. HALFLOOP-24 was meant to safeguard the automatic link establishment protocol in high frequency radio, but our research demonstrates that merely two hours of intercepted radio traffic are sufficient to recover the secret key. In the talk, we start with the fundamentals of symmetric key cryptography before going into the details of high frequency radio, HALFLOOP-24, and the foundation of our attack.", "speakers": ["3GWP8N"], "track": 6, "start": "2024-12-27T14:45:00+01:00", "end": "2024-12-27T15:45:00+01:00", "room": 2, "duration": 60, "updated": "2024-12-22T10:54:37.582894+00:00", "state": null, "do_not_record": false}, {"code": "8MSZTT", "id": 1982, "title": "Demystifying Common Microcontroller Debug Protocols", "abstract": "Many developers know that the answer to \"How do I debug this microcontroller\" is either \"JTAG\" or \"SWD\". But what does that mean, exactly? How do you get from \"Wiggling wires\" to \"Programming a chip\" and \"Halting on breakpoints\"? This talk will cover how common debug protocols work starting from signals on physical wires, cover common mechanisms for managing embedded processors, and ending up at talking to various common microcontrollers.", "speakers": ["R8JSW9"], "track": 4, "start": "2024-12-27T14:45:00+01:00", "end": "2024-12-27T15:45:00+01:00", "room": 3, "duration": 60, "updated": "2024-12-22T10:54:37.582860+00:00", "state": null, "do_not_record": false}, {"code": "GDPEUA", "id": 1987, "title": "Investigating the Iridium Satellite Network", "abstract": "The Iridium satellite (phone) network is evolving and so is our understanding of it. Hardware and software tools have improved massively since our last update at 32C3. New services have been discovered and analyzed. Let's dive into the technical details of having a lot of fun with listening to satellites.", "speakers": ["RGAFL8", "G3KGDZ"], "track": 4, "start": "2024-12-27T16:00:00+01:00", "end": "2024-12-27T17:00:00+01:00", "room": 1, "duration": 60, "updated": "2024-12-22T10:54:37.582943+00:00", "state": null, "do_not_record": false}, {"code": "MAUBFS", "id": 1986, "title": "What the PHUZZ?! Finding 0-days in Web Applications with Coverage-guided Fuzzing", "abstract": "PHUZZ is a framework for Coverage-Guided Fuzzing of PHP Web Applications\r\n\r\nFuzz testing is an automated approach to vulnerability discovery. Coverage-guided fuzz testing has been extensively researched in binary applications and the domain of memory corruption vulnerabilities.\r\nHowever, many web vulnerability scanners still rely on black-box fuzzing (e.g., predefined sets of payloads or basic heuristics), which severely limits their vulnerability detection capabilities.\r\nIn this talk, we present our academic fuzzing framework, \"PHUZZ,\" and the challenges we faced in bringing coverage-guided fuzzing to PHP web applications. Our experiments show that PHUZZ outperforms related works and state-of-the-art vulnerability scanners in discovering seven different vulnerability classes.\r\nAdditionally, we demonstrate how PHUZZ uncovered over 20 potential security issues and two 0-day vulnerabilities in a large-scale fuzzing campaign of the most popular WordPress plugins.", "speakers": ["PYGMMA"], "track": 6, "start": "2024-12-27T16:00:00+01:00", "end": "2024-12-27T17:00:00+01:00", "room": 2, "duration": 60, "updated": "2024-12-22T10:54:37.582927+00:00", "state": null, "do_not_record": false}, {"code": "KNG7P3", "id": 1985, "title": "Als die Kommentarspalten brannten – 11 Monate Einsatz in Gaza", "abstract": "Der Krieg in Gaza als Reaktion auf die Terrorattacke vom 7. Oktober läuft mittlerweile über ein Jahr. Cadus ist seit Februar diesen Jahres in Gaza im Einsatz. Auch seit Februar diesen Jahres teilen wir wie so viele andere die Erfahrung, das vor dem Hintergrund unseres Einsatzes fernab von Gaza sich leidenschaftlich „politisch“ auseinandergesetzt wird. Nicht ÜBER unseren Einsatz wohlgemerkt, sondern darüber, ob wir jetzt die eine oder andere Seite genug verurteilen würden für die Art und Weise wie der Krieg geführt wird. In unserem Talk „Als die Kommentarspalten brannten – 11 Monate Einsatz in Gaza“ sprechen wir über die Herausforderungen, die unseren Einsatz tatsächlich begleiten.", "speakers": ["TXJYNQ", "7JAN8U"], "track": 7, "start": "2024-12-27T16:00:00+01:00", "end": "2024-12-27T17:00:00+01:00", "room": 3, "duration": 60, "updated": "2024-12-22T10:54:37.582910+00:00", "state": null, "do_not_record": false}, {"code": "HWSQQG", "id": 1989, "title": "KLARHEIT ALS WAFFE", "abstract": "UBERMORGEN infiltriert Kunst, Medien und digitale Monokulturen mit subversiver Affirmation. Wie Donald Trump auch, zerstören sie täglich ihr Geschäftsmodell, um daraus radikal neue Lösungen zu schaffen. Anhand von Projekten wie Vote-Auction, Google Will Eat Itself und PMC Wagner Arts dokumentieren sie ihre künstlerische Evolution im Never-Ending Now. Chaos ist ihre Methode, Kunst ihre Neue Ehrlichkeit, Klarheit ihre Waffe.", "speakers": ["CFNRMP", "X8A9J9"], "track": 1, "start": "2024-12-27T17:15:00+01:00", "end": "2024-12-27T18:15:00+01:00", "room": 1, "duration": 60, "updated": "2024-12-22T10:54:37.582976+00:00", "state": null, "do_not_record": false}, {"code": "BMDSF7", "id": 1990, "title": "An open-source guide to the galaxy: Our journey with Ariane 6", "abstract": "The 530 tons and 63 meter tall Ariane 6 rocket finally launched on July 9th 2024 carrying our open-source developed payloads – the SIDLOC experiment and the satellite Curium One – into space. SIDLOC tested a new, open, low-power standard for identifying and precisely locating spacecraft whilst our satellite Curium One established an open-source baseline for larger CubeSat systems and allowed us to test a bunch of new technologies. From sourcing a launch opportunity to the final integration onto the rocket at the spaceport in French Guiana we tell you about our biggest challenges and exceptional experiences of this adventure.", "speakers": ["YXXND7", "KBR8ZP"], "track": 4, "start": "2024-12-27T17:15:00+01:00", "end": "2024-12-27T18:15:00+01:00", "room": 3, "duration": 60, "updated": "2024-12-22T10:54:37.582993+00:00", "state": null, "do_not_record": false}, {"code": "YM3UTV", "id": 1988, "title": "From fault injection to RCE: Analyzing a Bluetooth tracker", "abstract": "The Chipolo ONE is a Bluetooth tracker built around the Dialog (now Renesas)\r\nDA14580 chip. This talk will present the research made on this device, from\r\nextracting the firmware from the locked down chip using fault injection up to\r\ngetting remote code execution over Bluetooth.\r\nThe talk will also present the disclosure process and how the vendor reacted to\r\nan unpatchable vulnerability on their product.", "speakers": ["EEB9SH"], "track": 6, "start": "2024-12-27T17:15:00+01:00", "end": "2024-12-27T17:55:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.582960+00:00", "state": null, "do_not_record": false}, {"id": 1993, "title": {"de": "Pause", "en": "break"}, "start": "2024-12-27T17:15:00Z", "end": "2024-12-27T19:15:00+01:00", "room": 2}, {"id": 1992, "title": {"de": "Pause", "en": "break"}, "start": "2024-12-27T17:15:00Z", "end": "2024-12-27T19:15:00+01:00", "room": 3}, {"id": 1991, "title": {"de": "Pause", "en": "break"}, "start": "2024-12-27T17:15:00Z", "end": "2024-12-27T19:15:00+01:00", "room": 1}, {"code": "ASBXWW", "id": 1996, "title": "BioTerrorism Will Save Your Life with the 4 Thieves Vinegar Collective", "abstract": "Governments have criminalized the practice of managing your own health. Despite the fact that for most of human history bodily autonomy, and self-managed health was the norm, it is now required that most aspects of your health must be mediated by an institution deputized by the state. Taking those rights back for yourself is then labeled \"BioTerrorism\". So be it. Let's learn how.", "speakers": ["A7TWWU"], "track": 7, "start": "2024-12-27T19:15:00+01:00", "end": "2024-12-27T19:55:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.583129+00:00", "state": null, "do_not_record": false}, {"code": "ANJUV8", "id": 1994, "title": "From Silicon to Sovereignty: How Advanced Chips are Redefining Global Dominance", "abstract": "Recent breakthroughs in machine learning have dramatically heightened the demand for cutting-edge computing chips, driving advancements in semiconductor technologies. At the forefront of this progress is Extreme Ultraviolet (EUV) lithography—a transformative method in microchip fabrication that enables the creation of ultra-small, high-performance devices. However, the path from raw materials to these state-of-the-art chips navigates a complex global supply chain riddled with technical challenges and geopolitical tensions. As nations vie for dominance in computing power, control over this supply chain has emerged as a strategic priority, featuring prominently in a high-stakes competition with global implications. Designed for all audiences, this talk explores the critical intersection of science, technology and global affairs shaping our future.", "speakers": ["QZX9CY"], "track": 4, "start": "2024-12-27T19:15:00+01:00", "end": "2024-12-27T19:55:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.583093+00:00", "state": null, "do_not_record": false}, {"code": "XCLUY7", "id": 1995, "title": "Dead Man’s Switch. An art shield to protect the life of Julian Assange", "abstract": "Artist Andrei Molodkin held $45million of art hostage to free Julian Assange. He vowed to dissolve Picasso, Rembrandt, Warhol and other masterpieces in acid using a dead man’s switch device inside a 29-tonne Grade 5 Safe Room if Julian Assange was to die in prison. The talk will explain the process and methodology.", "speakers": ["QHMATE", "FVQTWA"], "track": 1, "start": "2024-12-27T19:15:00+01:00", "end": "2024-12-27T19:55:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.583111+00:00", "state": null, "do_not_record": false}, {"code": "MDN3PU", "id": 1999, "title": "Der Thüring-Test für Wahlsoftware", "abstract": "PC-Wahl war nur der Anfang.", "speakers": ["MZXSRS", "3KYFVK"], "track": 7, "start": "2024-12-27T20:15:00+01:00", "end": "2024-12-27T20:55:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.583179+00:00", "state": null, "do_not_record": false}, {"code": "QR7CRG", "id": 1997, "title": "EU's Digital Identity Systems - Reality Check and Techniques for Better Privacy", "abstract": "Digital identity solutions, such as proposed through the EU's eIDAS regulation, are reshaping the way users authenticate online. In this talk, we will review the currently proposed technical designs, the impact such systems will have, and provide an outlook on how techniques from modern cryptography can help to improve security and privacy.", "speakers": ["ULFQKZ", "UX9KST"], "track": 6, "start": "2024-12-27T20:15:00+01:00", "end": "2024-12-27T20:55:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.583146+00:00", "state": null, "do_not_record": false}, {"code": "WADJP3", "id": 1998, "title": "Spatial Interrogations Or the Color of the Sky", "abstract": "Modern 3D capture through Gaussian Splatting and human memory reveal parallel landscapes – where precise centers fade into probabilistic smears at the edges, and gaps hold as much meaning as detail. This is about the preservation of an ephemeral present in digital amber, an interrogation of how we reconstruct both digital and remembered spaces.", "speakers": ["DBCLFN"], "track": 1, "start": "2024-12-27T20:15:00+01:00", "end": "2024-12-27T20:55:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.583163+00:00", "state": null, "do_not_record": false}, {"code": "7RBKND", "id": 2002, "title": "Was macht ein IT-Systemadministrator in einem Alu-Schmelzwerk (Schafft die Deutsche Industrie die Digitalisierung)", "abstract": "In diesem Vortrag ziehe ich ein schonungsloses Resümee aus meinen mittlerweile fast drei Jahren in der Deutschen Industrielandschaft. Ich erzähle über katastrophale und gefühlt unüberwindbare Rückstände, über lächerlich hohe Anforderungen bei Zertifizierungen, aber auch über große Hoffnungen, Bemühungen und eine gefühlt vollständige Abwesenheit des Staats und was das bedeutet.", "speakers": ["7XJF99"], "track": 7, "start": "2024-12-27T21:10:00+01:00", "end": "2024-12-27T21:50:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.583228+00:00", "state": null, "do_not_record": false}, {"code": "3UWT9A", "id": 2000, "title": "Feelings are Facts: Love, Privacy, and the Politics of Intellectual Shame", "abstract": "A debut of new research and analysis, focused on emotions and the affective register—love! shame! intimacy!", "speakers": ["FVHASV"], "track": 2, "start": "2024-12-27T21:10:00+01:00", "end": "2024-12-27T21:50:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.583195+00:00", "state": null, "do_not_record": false}, {"code": "WFEH8C", "id": 2001, "title": "How to Spec - Fun with dinosaurs", "abstract": "The public image of dinosaurs is largely shaped by art. While paleontology is a dynamic and productive science, it is primarily through paleoart that our perception of prehistoric life takes form. By combining informed speculation with a deep understanding of anatomy, ecology, and geology, paleoartists continuously reimagine extinct organisms in innovative ways.", "speakers": ["GUJ79K"], "track": 1, "start": "2024-12-27T21:10:00+01:00", "end": "2024-12-27T21:50:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.583212+00:00", "state": null, "do_not_record": false}, {"code": "CMQST8", "id": 2003, "title": "Proprietary silicon ICs and dubious marketing claims? Let's fight those with a microscope!", "abstract": "Custom silicon chips are black boxes that hold many secrets, like internal ROMs, security features and audio DSP algorithms. How does one start reverse engineer them? Let's look at the basics of silicon reverse engineering, what gate array chips are, and how some tooling can generate Verilog code automatically from a die shot.", "speakers": ["Y8GPFY"], "track": 4, "start": "2024-12-27T22:05:00+01:00", "end": "2024-12-27T22:45:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.583245+00:00", "state": null, "do_not_record": false}, {"code": "TEAHVC", "id": 2005, "title": "Wie wird gleich?", "abstract": "Welchen Einfluss hat die Form der Dinge? Wie wirken wir durch die Gestaltung unseren kulturellen Praxen, Architekturen, Sprachen und Strukturen auf uns und die uns umgebende Zukunft ein? Und warum findet sich in zeitgenössischer Design Theorie ein Verb wie *Futuring*?", "speakers": ["ELFVJX"], "track": 1, "start": "2024-12-27T22:05:00+01:00", "end": "2024-12-27T22:45:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.583278+00:00", "state": null, "do_not_record": false}, {"code": "HTWLCG", "id": 2007, "title": "We've not been trained for this: life after the Newag DRM disclosure", "abstract": "You've probably already heard the story: we got contracted to analyze a bunch of trains breaking down after being serviced by independent workshops. We reverse engineered them and found code which simulated failures when they detected servicing attempts. We presented our findings at 37C3… and then shit hit the fan.", "speakers": ["9YS9EC", "QN9XMB", "XENBAM"], "track": 4, "start": "2024-12-27T23:00:00+01:00", "end": "2024-12-28T00:00:00+01:00", "room": 1, "duration": 60, "updated": "2024-12-22T10:54:37.583312+00:00", "state": null, "do_not_record": false}, {"code": "P9WRAY", "id": 2008, "title": "IRIS: Non-Destructive Inspection of Silicon", "abstract": "IRIS (Infra-Red, *in situ*) is a technique for non-destructively inspecting the construction of a select but common type of chip. It can improve visibility into our hardware and provide supporting evidence of its correct construction, without desoldering chips or expensive analytical gear. This talk covers the theory behind IRIS, as well as some embodiments of the technique. I will also frame the relevance of IRIS in the face of various threat scenarios. Time permitting, I’ll also show how you can do it at home by peeking around a few chips as a demo.", "speakers": ["RLPKN8"], "track": 4, "start": "2024-12-27T23:00:00+01:00", "end": "2024-12-28T00:00:00+01:00", "room": 3, "duration": 60, "updated": "2024-12-22T10:54:37.583329+00:00", "state": null, "do_not_record": false}, {"code": "39HFD9", "id": 2006, "title": "Hacking the RP2350", "abstract": "Raspberry Pi's RP2350 microcontroller introduced a multitude of new hardware security features over the RP2040, and included a Hacking Challenge which began at DEF CON to encourage researchers to find bugs. The challenge has been defeated and the chip is indeed vulnerable (in at least one way). This talk will cover the process of discovering this vulnerability, the method of exploiting it, and avenues for deducing more about the relevant low-level hardware behavior.", "speakers": ["EHRJTA"], "track": 6, "start": "2024-12-27T23:00:00+01:00", "end": "2024-12-28T00:00:00+01:00", "room": 2, "duration": 60, "updated": "2024-12-22T10:54:37.583295+00:00", "state": null, "do_not_record": false}, {"code": "TPGRNN", "id": 2011, "title": "A Competitive Time-Trial AI for Need for Speed: Most Wanted Using Deep Reinforcement Learning", "abstract": "All challenges and achievements in creating a competitive time-trial AI in NFS:MW.", "speakers": ["CTUZKV"], "track": 4, "start": "2024-12-28T00:15:00+01:00", "end": "2024-12-28T00:55:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.583378+00:00", "state": null, "do_not_record": false}, {"code": "JKACDE", "id": 2103, "title": "Blåmba! ☎️ Behind the scenes of a 2000s-style ringtone provider", "abstract": "A Deep Dive into WAP, SMS, monophonic ringtones and 1-bit graphics.", "speakers": ["TEQMJJ"], "track": 1, "start": "2024-12-28T00:15:00+01:00", "end": "2024-12-28T00:55:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-23T20:57:14.701803+00:00", "state": null, "do_not_record": false}, {"code": "9C3JXS", "id": 2009, "title": "Desiring Technology. Über Porno, Abhängigkeit und Fortschritt", "abstract": "Eine wachsende Zahl von Menschen eignet sich ihre empfundene Abhängigkeit von digitaler Pornografie als mystischen Fetisch an – sie konsumieren ihren Konsum. Was ist Gooning, wie hat es sich entwickelt und was kann es uns über unser Verhältnis zu Medientechnologie im weiteren Sinn erzählen?", "speakers": ["KQQQXV"], "track": 3, "start": "2024-12-28T00:15:00+01:00", "end": "2024-12-28T00:55:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.583345+00:00", "state": null, "do_not_record": false}, {"code": "GUFA37", "id": 2012, "title": "Fnord-Nachrichtenrückblick 2024", "abstract": "Wir zeigen euch die Fnords in den Nachrichten des Jahres.", "speakers": ["JVBQBW", "NFKBFE"], "track": 3, "start": "2024-12-28T01:10:00+01:00", "end": "2024-12-28T02:40:00+01:00", "room": 1, "duration": 90, "updated": "2024-12-22T10:54:37.583395+00:00", "state": null, "do_not_record": false}, {"id": 2015, "title": {"de": "Testbild", "en": "test image"}, "start": "2024-12-28T01:40:00Z", "end": "2024-12-28T11:00:00+01:00", "room": 1}, {"id": 2013, "title": {"de": "Testbild", "en": "test image"}, "start": "2024-12-28T01:40:00Z", "end": "2024-12-28T10:00:00+01:00", "room": 3}, {"id": 2014, "title": {"de": "Testbild", "en": "test image"}, "start": "2024-12-28T01:40:00Z", "end": "2024-12-28T11:00:00+01:00", "room": 2}, {"code": "H79XHC", "id": 2016, "title": "Junghacker:innentag Einführung", "abstract": "Zu unserer Freude haben sich in den letzten Jahren immer mehr Junghacker:innen auf dem Congress eingefunden. Daher bieten wir auch diesmal, wie schon in den Vorjahren, einen speziell auf Kinder und Jugendliche zugeschnittenen Junghacker:innentag an. Am zweiten Congresstag, dem 28. Dezember 2024, organisieren Freiwillige aus vielen Assemblies von etwa 10 bis 17 Uhr ein vielseitiges Workshop-Programm für angehende Hacker:innen.", "speakers": [], "track": 2, "start": "2024-12-28T10:00:00+01:00", "end": "2024-12-28T10:45:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T21:36:54.263313+00:00", "state": null, "do_not_record": false}, {"code": "S3WJCS", "id": 2018, "title": "Illegal instructions by legals - Anweisungen für den anwaltlich begleiteten Rechtsbruch", "abstract": "Tracker an Tiertransporter, Kameras vor einer Steueroase, Veröffentlichungen von Verschlusssachen, Frontex verpetzen oder sich selbst verpetzen lassen, Menschen in Seenot retten. Zwei Anwältinnen, die Recht(sbruch) studiert haben, teilen mit euch ihre Erfahrungen aus juristischer out of Action preparation, Whistleblowing-Schutz und Anti-Repressions-Arbeit.", "speakers": ["JZLQSQ", "HSY7UP"], "track": 7, "start": "2024-12-28T11:00:00+01:00", "end": "2024-12-28T11:40:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-23T12:49:12.594460+00:00", "state": null, "do_not_record": true}, {"code": "NAGY9B", "id": 2017, "title": "Lightning Talks Day 2", "abstract": "Lightning Talks are short lectures (almost) any congress participant may give! Bring your infectious enthusiasm to an audience with a short attention span! Discuss a program, system or technique! Pitch your projects and ideas or try to rally a crew of people to your party or assembly! Whatever you bring, make it quick!", "speakers": [], "track": 2, "start": "2024-12-28T11:00:00+01:00", "end": "2024-12-28T13:00:00+01:00", "room": 3, "duration": 120, "updated": "2024-12-22T10:54:37.583494+00:00", "state": null, "do_not_record": false}, {"code": "XR9FGQ", "id": 2019, "title": "Role Play as Resistance: Challenging Securitization Through Activism in a place in EastAfrica", "abstract": "Using role playing, we shall explore the movements who are proactively fighting back the impact of surveillance and challenges Internet-related rights.", "speakers": ["EDLBKY"], "track": 7, "start": "2024-12-28T11:00:00+01:00", "end": "2024-12-28T11:40:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-23T11:23:24.021907+00:00", "state": null, "do_not_record": true}, {"code": "MGSXPN", "id": 2020, "title": "Gemeinwohlorientierte Forschung mit KI: Missbrauch eindämmen durch Zweckbindung für KI-Modelle", "abstract": "Trainierte KI-Modelle sind mächtige Werkzeuge, die in Wissenschaft und Forschung oft für gute Zwecke gebaut werden. Aber wie alle Werkzeuge können sie auch zweckentfremdet werden – in Bereichen, für die sie nicht gedacht waren, in denen sie profitgierigen Interessen dienen und gesellschaftlichen Schaden anrichten. Vor dem Hintergrund des Trends von \"open source\" AI ist die Gefahr der unkontrollierten Zweckentfremdung von KI-Modellen enorm gestiegen. Wir zeigen: Das Risiko einer missbräuchlichen Sekundärnutzung von für Forschungszwecke trainierten KIs ist aktuell die größte regulatorische Lücke, trotz DSGVO und AI-Act. Zugleich ermöglicht das Zweckentfremden von Modellen die immer weiter wachsende Machtposition von Big Tech. Um das Problem zu bekämpfen, muss das Prinzip \"Zweckbindung\" für das Zeitalter der KI geupdated werden.", "speakers": ["U7VYJQ", "GN8CRZ"], "track": 5, "start": "2024-12-28T12:00:00+01:00", "end": "2024-12-28T12:40:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.583544+00:00", "state": null, "do_not_record": false}, {"code": "MWGDZZ", "id": 2021, "title": "Digitalisierung mit der Brechstange", "abstract": "Fünf Prozent der Bevölkerung im Alter von 16 bis 74 Jahren in Deutschland sind offline. Dafür gibt es verschiedenen Gründe: Manche wollen nicht ins Netz und manche können nicht. Dennoch gibt es zunehmend auch öffentliche Dienstleistungen nur noch digital.\r\n\r\nDas wäre kein Problem, wenn gewährleistet wäre, dass alle Zugang zu Geräte, zum Netz und die nötige Unterstützung haben, um die Angebote nutzen zu können. Und wenn wir darauf vertrauen könnten, dass unsere Daten dort sicher sind. \r\n\r\nSolange beides nicht gegeben ist, darf niemand ausgeschlossen werden, weil der Zugang fehlt.", "speakers": ["J9SHZR"], "track": 7, "start": "2024-12-28T12:00:00+01:00", "end": "2024-12-28T12:40:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.583561+00:00", "state": null, "do_not_record": false}, {"code": "SSEEUQ", "id": 2022, "title": "Erpressung aus dem Internet - auf den Spuren der Cybermafia", "abstract": "Manchmal sind es tausende, manchmal sind es zehntausende von Euros, um die vor allem junge Männer aus Deutschland bei Onlinescams betrogen werden. Die Scham ist zu groß, um darüber zu sprechen, schließlich ist „Mann“ selbst schuld daran. Es geht um Erpressung mit Nacktfotos, Liebes-Fallen und zweifelhafte Investments, die auf dem Vormarsch sind. Der Vortrag folgt den Spuren der Täter:innen und enthüllt eine prosperierende Scam-Industrie in Asien, fest in den Händen der chinesischen Mafia.", "speakers": ["TSUD8L", "KBTVLY"], "track": 7, "start": "2024-12-28T12:55:00+01:00", "end": "2024-12-28T13:35:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.583577+00:00", "state": null, "do_not_record": false}, {"code": "YWU87Y", "id": 2023, "title": "A policy black hole. How Europol and Frontex anticipated their high tech future and why this matters to you.", "abstract": "This is the story of how a group of journalists and researchers started examining how the transformative introduction of novel technologies was reshaping the policy priorities of EU's law enforcement agencies. Very early on, this was like diving deep into the ocean without an underwater flashlight. And it didn't get much easier with time. \r\nWhat are the risks for civil liberties and privacy that lie in the dark while this agenda is unfolding and how hard is it to make them more transparent?", "speakers": ["UGMN7G"], "track": 7, "start": "2024-12-28T12:55:00+01:00", "end": "2024-12-28T13:35:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.583594+00:00", "state": null, "do_not_record": true}, {"code": "CUFLJP", "id": 2024, "title": "From Pegasus to Predator - The evolution of Commercial Spyware on iOS", "abstract": "My talk explores the trajectory of iOS spyware from the initial discovery of Pegasus in 2016 to the latest cases in 2024.\r\n\r\nThe talk will start with an analysis how exploits, infection vectors and methods of commercial spyware on iOS have changed over time.\r\n\r\nThe second section of the talk is all about advances in detection methods and the forensic sources which are available to discover commercial spyware. This talk will also include a Case Study about the discovery and analysis of BlastPass (one of the latest NSO Exploits).\r\n\r\nThe third part will discuss technical challenges and limitations of the detections methods and data sources.\r\n\r\nFinally, I will conclude the talk with open research topics and suggestions what Apple or we could technically do to make the detection of commercial spyware better.", "speakers": ["K3ZGYZ"], "track": 6, "start": "2024-12-28T13:30:00+01:00", "end": "2024-12-28T14:30:00+01:00", "room": 3, "duration": 60, "updated": "2024-12-22T10:54:37.583610+00:00", "state": null, "do_not_record": false}, {"code": "MUZZ7C", "id": 2025, "title": "Wann klappt der Anschluss, wann nicht und wie sagt man Chaos vorher?", "abstract": "Gut 1 Mrd. Datenpunkte zu Zugfahrten, wie kann man damit das Zugfahren verbessern? Wir versuchen, die Zuverlässigkeit von Zugverbindungen vor der Buchung zu prognostizieren.", "speakers": ["GM3CMB"], "track": 5, "start": "2024-12-28T13:50:00+01:00", "end": "2024-12-28T14:30:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.583626+00:00", "state": null, "do_not_record": false}, {"code": "WFHKTR", "id": 2026, "title": "Pirouette Machines. Fluid Components", "abstract": "This lecture follows the path of an ex-ballerina through fluid computers, handmade semiconductors, and cosmetic synthesisers. We will tackle the seductive side and hidden narratives of circuitry to natural systems, salty fluids, and minerals and discuss the importance of alternative hardware morphologies.", "speakers": ["UARYFS"], "track": 1, "start": "2024-12-28T13:50:00+01:00", "end": "2024-12-28T14:30:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.583644+00:00", "state": null, "do_not_record": false}, {"code": "QS9AXX", "id": 2029, "title": "Fearsome File Formats", "abstract": "Specifications are enough, they say…\r\n\r\n10 years after 31c3's \"Funky File Formats\" …\r\n\r\nHave things improved?", "speakers": ["DWMZX3"], "track": 6, "start": "2024-12-28T14:45:00+01:00", "end": "2024-12-28T15:45:00+01:00", "room": 1, "duration": 60, "updated": "2024-12-22T10:54:37.583692+00:00", "state": null, "do_not_record": false}, {"code": "DJR7VP", "id": 2028, "title": "MacOS Location Privacy Red Pill: A Rabbit Hole Resulting in 24 CVEs", "abstract": "User location information is inherently privacy sensitive as it reveals a lot about us: Where do we work and live? Which cities, organizations & institutions do we visit? How does our weekly routine look like? When are we on a vacation and not at home?\r\nMacOS has introduced multiple layers of security mitigations to protect sensitive user location information from attackers and malicious applications over the years — but are these enough?", "speakers": ["SLT3Y8"], "track": 6, "start": "2024-12-28T14:45:00+01:00", "end": "2024-12-28T15:45:00+01:00", "room": 3, "duration": 60, "updated": "2024-12-22T10:54:37.583676+00:00", "state": null, "do_not_record": false}, {"code": "LR3GTU", "id": 2027, "title": "State of Surveillance: A year of digital threats to civil society", "abstract": "The digital arms race between activists and government spies continues to shift and evolve. Through a series of cases studies, researchers from Amnesty International's Security Lab will share surveillance wins, the ongoing challenges, and the new threats on the digital horizon.", "speakers": ["CDBGNV"], "track": 6, "start": "2024-12-28T14:45:00+01:00", "end": "2024-12-28T15:45:00+01:00", "room": 2, "duration": 60, "updated": "2024-12-22T10:54:37.583660+00:00", "state": null, "do_not_record": false}, {"code": "3TSPQW", "id": 2030, "title": "Self Models of Loving Grace", "abstract": "Artificial Intelligence is not just an engineering discipline, but also the most fascinating and important philosophical project ever attempted: the explanation of the mind, by recreating it. This part of the series \"From Computation to Consciousness\" focuses on the nature of the self, agency and identity.", "speakers": ["URY3ED"], "track": 5, "start": "2024-12-28T16:00:00+01:00", "end": "2024-12-28T17:00:00+01:00", "room": 2, "duration": 60, "updated": "2024-12-22T10:54:37.583708+00:00", "state": null, "do_not_record": false}, {"code": "UVYCZZ", "id": 2032, "title": "10 years of emulating the Nintendo 3DS: A tale of ninjas, lemons, and pandas", "abstract": "How is 3DS preservation faring 10 years after the release of the first emulator? What technical obstacles have we overcome, which ones remain? What hidden gems have we discovered beyond games? Join us on a journey through the struggles, the successes, and the future of 3DS emulation!", "speakers": ["8JXB8Y"], "track": 4, "start": "2024-12-28T16:00:00+01:00", "end": "2024-12-28T17:00:00+01:00", "room": 3, "duration": 60, "updated": "2024-12-22T10:54:37.583741+00:00", "state": null, "do_not_record": false}, {"code": "LE7FJL", "id": 2031, "title": "Der CCC-Jahresrückblick", "abstract": "Wir geben einen Überblick über die Themen, die den Chaos Computer Club 2024 beschäftigt haben.\r\n\r\nNeben der Zusammenfassung und der Rückschau auf das vergangene Jahr wollen wir aber auch über zukünftige Projekte und anstehende Diskussionen reden.", "speakers": ["VJ3ZVS", "LPFEDA", "H9GEPE", "MZXSRS", "FCLVFD"], "track": 2, "start": "2024-12-28T16:00:00+01:00", "end": "2024-12-28T18:00:00+01:00", "room": 1, "duration": 120, "updated": "2024-12-22T10:54:37.583725+00:00", "state": null, "do_not_record": false}, {"code": "LNDJX3", "id": 2034, "title": "io_uring, eBPF, XDP and AF_XDP", "abstract": "Modern high-performance networking APIs on Linux - beyond the classic BSD sockets API.", "speakers": ["LBUJDK"], "track": 6, "start": "2024-12-28T17:15:00+01:00", "end": "2024-12-28T18:15:00+01:00", "room": 3, "duration": 60, "updated": "2024-12-22T10:54:37.583774+00:00", "state": null, "do_not_record": false}, {"code": "Z7TFKB", "id": 2033, "title": "arafed futures - An Artist Dialogue on Chip Storage and AI Accelerationism", "abstract": "The global chip shortage during the COVID-19 pandemic brought semiconductor production into focus, sparking accelerated efforts to meet the surging demand for digital infrastructure. This phenomenon not only expanded AI capabilities but also introduced unexpected computational artifacts. \r\nOne such artifact is the word “arafed”, a term absent from any dictionary yet mysteriously appears across contexts from image prompts to Amazon product descriptions. Such unintended linguistic artifacts, born from transformer-based AI models, exemplify how digital artifacts emerge into realities with which we cohabitate.\r\nThe talk investigates how supply-chains break and AI-words spread from an artistic research perspective. Mapping both the abstract landscapes of embedding spaces, that are filled with emergent words and images, and the tangible, geopolitical realities of global semiconductor supply chains.", "speakers": ["FDYRKA", "SEHVM7"], "track": 1, "start": "2024-12-28T17:15:00+01:00", "end": "2024-12-28T18:15:00+01:00", "room": 2, "duration": 60, "updated": "2024-12-22T10:54:37.583757+00:00", "state": null, "do_not_record": false}, {"id": 2037, "title": {"de": "Pause", "en": "break"}, "start": "2024-12-28T17:15:00Z", "end": "2024-12-28T19:15:00+01:00", "room": 1}, {"id": 2035, "title": {"de": "Pause", "en": "break"}, "start": "2024-12-28T17:15:00Z", "end": "2024-12-28T19:15:00+01:00", "room": 3}, {"id": 2036, "title": {"de": "Pause", "en": "break"}, "start": "2024-12-28T17:15:00Z", "end": "2024-12-28T19:15:00+01:00", "room": 2}, {"code": "XDWNRG", "id": 2038, "title": "Autoritäre Zeitenwende im Zeitraffer", "abstract": "Die mittlerweile zerbrochene „Fortschrittskoalition“ hat zuletzt mit dem Bohrhammer Grundrechte abgetragen, als gäbe es einen Preis zu gewinnen. Wer als nächstes das Land regiert, ist offen. Aber progressiver wird es wohl kaum. Warum das keine plötzliche Entwicklung ist und was wir jetzt dagegen tun müssen.", "speakers": ["MF7ZLU", "NWUNRH"], "track": 7, "start": "2024-12-28T19:15:00+01:00", "end": "2024-12-28T20:15:00+01:00", "room": 3, "duration": 60, "updated": "2024-12-22T10:54:37.583855+00:00", "state": null, "do_not_record": false}, {"code": "DSQ9FN", "id": 2039, "title": "Hacking yourself a satellite - recovering BEESAT-1", "abstract": "In 2013, the satellite BEESAT-1 started returning invalid telemetry, rendering it effectively unusable. Because it is projected to remain in orbit for at least another 20 years, recovering the satellite and updating the flight software would enable new experiments on the existing hardware. However, in addition to no access to telemetry, the satellite also has no functional software update feature. This talk will tell the story of how by combining space and computer security mindsets, the fault was correctly diagnosed without telemetry, software update features were implemented without having them to begin with, and the satellite was recovered in September of 2024.", "speakers": ["7B9PTJ"], "track": 4, "start": "2024-12-28T19:15:00+01:00", "end": "2024-12-28T20:15:00+01:00", "room": 1, "duration": 60, "updated": "2024-12-22T10:54:37.583872+00:00", "state": null, "do_not_record": false}, {"code": "ADE7AG", "id": 2040, "title": "The master key", "abstract": "This is the story of the HDCP master key that we derived back in 2010.", "speakers": ["TVMJBS", "ZERVKP"], "track": 6, "start": "2024-12-28T19:15:00+01:00", "end": "2024-12-28T20:15:00+01:00", "room": 2, "duration": 60, "updated": "2024-12-22T10:54:37.583888+00:00", "state": null, "do_not_record": false}, {"code": "VPZWZK", "id": 2043, "title": "Fake-Shops von der Stange: BogusBazaar", "abstract": "Du bestellst im Internet? Natürlich bestellst Du im Internet. Aber dieses Mal wird Deine Ware nicht geliefert. Stattdessen sind Dein Geld und Deine Kreditkartendaten nun in China. Das ist BogusBazaar. Wir teilen unsere Einblicke in die Arbeitsweise dieser Bande.", "speakers": ["LPFEDA", "XXQZRD"], "track": 6, "start": "2024-12-28T20:30:00+01:00", "end": "2024-12-28T21:30:00+01:00", "room": 1, "duration": 60, "updated": "2024-12-22T10:54:37.583938+00:00", "state": null, "do_not_record": false}, {"code": "Q98U7B", "id": 2042, "title": "Vectors, Pixels, Plotters and Public Participation", "abstract": "The talk introduces technology-driven urban art projects that emphasize public participation and creativity. Each project employs a DIY machine to transform public spaces and create art collaboratively. How were these machines built? How do ideas evolve, and how can creative machines foster community connections? Find the answers and get some inspirations in this entertaining and insightful talk by Niklas a.k.a. royrobotiks.", "speakers": ["CYESEX"], "track": 1, "start": "2024-12-28T20:30:00+01:00", "end": "2024-12-28T21:30:00+01:00", "room": 3, "duration": 60, "updated": "2024-12-22T10:54:37.583921+00:00", "state": null, "do_not_record": false}, {"code": "WQ9SLQ", "id": 2041, "title": "Guardians of the Onion: Ensuring the Health and Resilience of the Tor Network", "abstract": "Millions of internet users around the world rely on Tor to protect themselves from surveillance and censorship. While Tor-powered applications and the Tor protocol are widely known, the community behind it much less so. This talk will highlight the efforts to maintain a healthy and resilient Tor network, emphasizing the crucial role of a diverse, engaged community of relay operators.\r\n\r\nWe’ll discuss some recent news, the current state of the network, how we determine its health, and the strategies to strengthen its resilience, addressing challenges around sustainability and governance. If you're interested in understanding the inner workings of the Tor network, this talk is for you.", "speakers": ["HEDDSQ", "EZWH9S"], "track": 6, "start": "2024-12-28T20:30:00+01:00", "end": "2024-12-28T21:30:00+01:00", "room": 2, "duration": 60, "updated": "2024-12-22T10:54:37.583905+00:00", "state": null, "do_not_record": false}, {"code": "VL9VZ9", "id": 2046, "title": "Feelings of Structure in Life, Art, and Neural Nets", "abstract": "'Poetry' as the name of a special human relation to the world -- some special kind of knowing, grasping, challenging or asking we effect through art -- came into focus in 18th century Europe alongside the first blushings of a theory of computation and a computational analysis of mind. This talk proposes that for all of their outward hostilities, the Romantic-and-on idea of poetry and computational approaches to thought, language, and meaning are deeply connected: starting from Kant's doctrine of the productive imagination, we will develop one historical thread that runs to the Romantic poets, Phenomenology, and literary theory, and one historical thread that runs to information theory, machine learning, and the science of neural network models. Comparing the two threads, I'll argue that poetics and the science of neural network models have genuinely (if partially) overlapping subject-matter. \r\n\r\nPeli Grietzer is a researcher and writer specializing in ML, philosophy, and literary studies. Grietzer received his PhD from Harvard Comparative Literature in collaboration with the HUJI Einstein Institute of Mathematics.", "speakers": ["3B83Y7"], "track": 1, "start": "2024-12-28T21:45:00+01:00", "end": "2024-12-28T22:45:00+01:00", "room": 2, "duration": 60, "updated": "2024-12-22T10:54:37.583989+00:00", "state": null, "do_not_record": false}, {"code": "HSNZGR", "id": 2044, "title": "BlinkenCity: Radio-Controlling Street Lamps and Power Plants", "abstract": "A significant portion of Europe's renewable energy production can be remotely controlled via longwave radio. While this system is intended to stabilize the grid, it can potentially also be abused to destabilize it by remotely toggling energy loads and power plants. \r\n\r\nIn this talk, we will dive into radio ripple control technology, analyze the protocols in use, and discuss whether its weaknesses could potentially be leveraged to cause a blackout, or – more positively – to create a city-wide Blinkenlights-inspired art installation.", "speakers": ["C87MMB", "MSVAFM"], "track": 6, "start": "2024-12-28T21:45:00+01:00", "end": "2024-12-28T22:45:00+01:00", "room": 1, "duration": 60, "updated": "2024-12-22T10:54:37.583955+00:00", "state": null, "do_not_record": false}, {"code": "8U8ARN", "id": 2045, "title": "RadioMining - Playlist-Scraping und Analyse", "abstract": "Seit einigen Jahren hat Stefan von etwa vierzig regulären deutschen (Pop-)Radiosendern die Playlisten gespeichert. Welche Meta-Informationen sich daraus ergeben und welche Abhängigkeiten von Jahreszeiten, Charts und Ereignissen sich abzeichnen, wird in einem unterhaltsamen Vortrag zum Besten gegeben.", "speakers": ["UKSDRS"], "track": 5, "start": "2024-12-28T21:45:00+01:00", "end": "2024-12-28T22:45:00+01:00", "room": 3, "duration": 60, "updated": "2024-12-22T10:54:37.583972+00:00", "state": null, "do_not_record": false}, {"code": "JQS3KA", "id": 2049, "title": "Automation and Empathy: Can We Finally Replace All Artistic Performers with Machines?", "abstract": "In this talk, artist and robotic musician Moritz Simon Geist explores whether robots and avatars can establish an emotional connection with a human audience, and examines the implications this has for arts and culture.", "speakers": ["HXHJSY"], "track": 1, "start": "2024-12-28T23:00:00+01:00", "end": "2024-12-28T23:40:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.584039+00:00", "state": null, "do_not_record": false}, {"code": "TJ8QVD", "id": 2047, "title": "Wie fliegt man eigentlich Flugzeuge?", "abstract": "Etwas wie die \"Sendung mit der Maus\", dafür mit tiefer fachlicher Ausführung und allen Details. Es handelt vor allem um Technik und Abläufe, die man als Laie oder Fluggast nicht sehen und wissen kann.", "speakers": ["ZSAGCE", "R8CWZD"], "track": 5, "start": "2024-12-28T23:00:00+01:00", "end": "2024-12-28T23:40:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.584005+00:00", "state": null, "do_not_record": false}, {"code": "ETSHKS", "id": 2048, "title": "Projekt Bucketchallenge", "abstract": "S3 Buckets mit kübelweise privaten Daten: Finden, melden, kein Problem. Aber grundlegend was ändern? Denkste!", "speakers": ["MLSWTE"], "track": 6, "start": "2024-12-28T23:00:00+01:00", "end": "2024-12-28T23:40:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.584022+00:00", "state": null, "do_not_record": false}, {"code": "LUW3YS", "id": 2050, "title": "KI-Karma next Level: Spiritueller IT-Vertrieb", "abstract": "Der IT-Vertrieb ist ein Feld voll dorniger Chancen. Ein Grund mehr, gemeinsam von innovativen Branchen in Form von \"Neuen Religiösen Bewegungen\" (Sekten) zu lernen, um unseren erwachten beruflichen Neustart zu pitchen.", "speakers": ["HR8WJ8"], "track": 3, "start": "2024-12-28T23:55:00+01:00", "end": "2024-12-29T00:35:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.584056+00:00", "state": null, "do_not_record": false}, {"code": "DTH9RS", "id": 2051, "title": "Escaping Big Brother (or Your Ex) - counter surveillance for women's shelters", "abstract": "Maintaining privacy and security when those closest to you is exploiting the worst of surveillance capitalism and patriarchy to pwn you is a user case no one planned for. Or should Big Tech have known better? \r\nGender-based violence has existed in all societies and centuries, but in the 21st one the digital arena is proving to be especially tricky for victims. \r\nWhen (primarily) women leave their abusive (primarily) male partners or family members they often have to leave behind everything and make a clean break - including from their digital identities. This is way easier said than done. (Ever tried unsubscribing from.. anything?) Surveillance capitalism has further exacerbated this challenge, as stalker-ware is becoming increasingly prevalent and easy to use, if not a default feature. Stalking As A Service is of course already a thing, and why should you watch someones house in the rain all night when you can let your Tesla do it for you? \r\nLost your wife? Hide an AirTag in the lining of her bag and have two billion iPhones keep track of her across the planet. Apple won't tell.\r\n \r\nIt's almost like society is fundamentally misogynistic and internet accelerated the opportunity for patriarchal control..?\r\n \r\nThis talk shares experiences working with women's shelters and training victims as well as activists and professionals in cyber security and opsec.\r\nThe situation's bad and it's getting worse, fast.", "speakers": ["SQ39BW"], "track": 7, "start": "2024-12-28T23:55:00+01:00", "end": "2024-12-29T00:35:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.584071+00:00", "state": null, "do_not_record": false}, {"code": "ALAJNW", "id": 2052, "title": "Die Faszination des echten Kugelspiels", "abstract": "Der Vortrag ist ein persönlicher Blick auf die Geschichte, Vielfalt und Entwicklung im Bereich der Flipperautomaten und ist motiviert durch die eigene Begeisterung für diese Form von Unterhaltungstechnik. Geschichte und Geschichten der Geräte wird anhand eigener Erfahrungen, Sammlung und Recherche sowie Geschehnissen und eigene Anwendungen der Geräte (Kauf, Reparatur, Restauration, Modifikation, ...) präsentiert und soll die Faszination und das Interesse dafür wecken oder Interessierte zusammenbringen. Es ist geplant, auch Geräte zum Kongress mitzubringen, die bespielt und/oder im Detail erklärt werden können und vielleicht sogar ein Gerät zum Basteln bereit zu stellen.", "speakers": ["RACQPP"], "track": 1, "start": "2024-12-28T23:55:00+01:00", "end": "2024-12-29T00:35:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.584088+00:00", "state": null, "do_not_record": false}, {"code": "8Q9JXV", "id": 2125, "title": "Kein Spaß am Gerät auf einem toten Planeten!", "abstract": "Seit Jahren kämpft das Bits-&-Bäume-Bündnis, dem auch der CCC seit Beginn angehört, für eine ökologische und sozial gerechte Digitalpolitik – 2024 war dabei ein Jahr voller Hochs und Tiefs: von erstmals sinkenden CO₂-Emissionen in Industrieländern, über den weiterbrennenden KI-Boom mit Nachhaltigkeitsanstrich, die Rolle von digitalen Plattformen für anti-demokratische und nicht-nachhaltige Bewegungen, den ökologischen Fußabruck von Profiling bis hin zum Tech-Solutionismus von Elon Musk jetzt im Weißen Haus.", "speakers": ["SUNSUE", "BTRVPF"], "track": 2, "start": "2024-12-29T00:55:00+01:00", "end": "2024-12-29T01:35:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-23T21:06:00.026603+00:00", "state": null, "do_not_record": false}, {"code": "9QB89V", "id": 2053, "title": "0, 1 oder 2 - Hackerei und Cyberbrei", "abstract": "Der Quizshow-Klassiker für die ganze Chaosfamilie: Bei uns sind nicht nur pfiffige Hacker:innen, sondern auch flinke Beine gefragt. 0, 1 oder 2? Wer es weiß, ist dabei! Nur echt mit dem Kamera-Nerd!", "speakers": ["RLN8QE"], "track": 3, "start": "2024-12-29T00:55:00+01:00", "end": "2024-12-29T02:25:00+01:00", "room": 1, "duration": 90, "updated": "2024-12-22T10:54:37.584104+00:00", "state": null, "do_not_record": false}, {"code": "UZXTXJ", "id": 2054, "title": "Net Neutrality: Why It Still Matters (More Than Ever!)", "abstract": "Net Neutrality is a core pillar of the open internet. But we witness a coordinated, world-wide attack from the telecom industry on the very foundation that ties the internet together. The interconnection of autonomous parts of the internet used to be a non-political and non-commercial field that not many paid attention to. But through heavy lobbying activity we are on the brink of regulating interconnection in the EU, Brazil and India to establish a new payment obligation that would force everyone who wants to send a significant amount of data to customers. Telecom companies would end up being paid twice for the same traffic, from their customers and the content and cloud providers that want to reach them.", "speakers": ["UX9KST", "EHYBMZ", "RMY3D3"], "track": 7, "start": "2024-12-29T00:55:00+01:00", "end": "2024-12-29T01:35:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.584121+00:00", "state": null, "do_not_record": false}, {"id": 2057, "title": {"de": "Testbild", "en": "test image"}, "start": "2024-12-29T01:30:00Z", "end": "2024-12-29T11:00:00+01:00", "room": 2}, {"id": 2056, "title": {"de": "Testbild", "en": "test image"}, "start": "2024-12-29T01:30:00Z", "end": "2024-12-29T09:30:00+01:00", "room": 3}, {"id": 2055, "title": {"de": "Testbild", "en": "test image"}, "start": "2024-12-29T01:30:00Z", "end": "2024-12-29T11:00:00+01:00", "room": 1}, {"code": "PSX7FY", "id": 2058, "title": "Azubi-Tag Einführung", "abstract": "Siehe ", "speakers": [], "track": 2, "start": "2024-12-29T09:30:00+01:00", "end": "2024-12-29T10:45:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.584201+00:00", "state": null, "do_not_record": true}, {"code": "73Q3KX", "id": 2060, "title": "Chatbots im Schulunterricht!?", "abstract": "Was können die Tools wirklich, was machen sie mit der “Bildung”, und sollten wir dafür Steuergelder ausgeben?\r\n\r\nSpätestens seit dem Hype um ChatGPT werden KI-Tools als magische Technofixes für Lehrkräftemangel und soziale Segregation im Bildungswesen angepriesen. Mehrere Bundesländer haben zum Beispiel Flächenlizenzen für alle Lehrkräfte bei dem Hamburger Unternehmen \"Fobizz\" erworben. Das Unternehmen bietet auf Basis großer Sprachmodelle (meist GPT-3/4) und verschiedener bildgenerierender KIs eine ganze Reihe von Bots sowohl für SchülerInnen als auch für LehrerInnen an: Tools zur automatisierten Korrektur und Bewertung von Hausaufgaben, Chatbot-basierte individuelle Lern-Coaches, Avatare zur Gesprächssimulation (\"mit Angela Merkel chatten\"), oder Bots zur Erstellung von individualisiertem Unterrichtsmaterial.\r\nWir haben das Fobizz-Tool zur automatisierten Korrektur von Hausaufgaben und Prüfungsleistungen detailliert unter die Lupe genommen. Funktioniert das wirklich? Wie wirkt sich das auf die Qualität des Unterrichts aus? Kann man LehrerInnen und SchülerInnen guten Gewissens darauf loslassen? – Unsere Antwort ist schockierend eindeutig: nein! Und es ist ein Skandal, dass Steuergelder dafür ausgegeben werden. Im Vortrag berichten wir von frustrierenden Irrfahrten wenn SchülerInnen den Korrekturen des KI-Tools folgen; von quasi ausgewürfelten Bewertungen (nach dem Motto: wenn dir die Note für diese Person nicht passt, drück einfach auf \"re-generate\"), und von der impliziten Botschaft an die SchülerInnen: Ihr müsst ChatGPT verwenden, sonst könnt ihr nicht gut abschneiden.", "speakers": ["U7VYJQ", "78TDA9"], "track": 7, "start": "2024-12-29T11:00:00+01:00", "end": "2024-12-29T11:40:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.584235+00:00", "state": null, "do_not_record": false}, {"code": "PR8EGC", "id": 2059, "title": "Sacrificing Chickens Properly: Why Magical Thinking is Both the Problem and the Solution.", "abstract": "As an Anthropologist, magical thinking is a normal fact of life. Rather than dismissing it outright, our job is to look at its function and yes, rationality, for groups at hand.\r\n\r\nStarting out with a story about actual chickens being sacrificed to ensure the harvest, this talk explores the prevalence of useful magical thinking in our own community. Using metaphors, or even personifications, doesn‘t make a person irrational. It‘s applying a principle implicitly onto a subject matter which works completely differently, that would be the problem. After all, unless you are a strict vegetarian, it‘s not the killing of a chicken as such you‘d object to, it‘s the idea that this act makes rain. \r\n\r\nWith LLMs, our public sphere has run into a problem where experts are at loss explaining a very complicated thing to a general public, which often lacks the basic terms with which to understand how this mechanism works. The instant personification of LLMs can lead to vast mismatches between their actual capabilities and what those stories imply. Rather than dismissing them outright, the question posed would be, what‘s the alternative?\r\n\r\nThe talk is intended to be a light-hearted overview of some examples of both useful and dangerous constructions used to simplify complexity. It aims to touch upon some of the mechanisms that should be heeded in order to be able to tell a better story.", "speakers": ["D7MTME"], "track": 7, "start": "2024-12-29T11:00:00+01:00", "end": "2024-12-29T11:40:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.584218+00:00", "state": null, "do_not_record": false}, {"code": "WGGVDK", "id": 2061, "title": "Gefährliche Meinung – Wenn Wälder brennen und Klimaaktivist*innen im Knast sitzen", "abstract": "Eine Geschichte über den Kampf für Walderhalt in der Klimakrise, die unnötige Erweiterung eines klimaschädlichen Stahlwerks und einer vermutlich illegalen Genehmigung für eine vorgezogene Rodung. Wie wir dafür ins Gefängnis kamen. Und wie das Bundesverfassungsgericht die Gefängnisleitung zwang, mich vorzeitig wieder zu entlassen.\r\n\r\nAktivistische Kritik buchstäblich an der zuständigen Bezirksregierung endete in einem Gerichtskrimi durch die AugsburgerJustiz, die sich nach wie vor entschlossen zeigt, die laut Bundesverfassungsgericht besonders geschützte Machtkritik der Aktivist*innen möglichst hart zu bestrafen. \r\nEin Vortrag über den kreativen Umgang mit Repressionen mit Einblicken hinter die Gefängnismauern. \r\nVom Kampf der Augsburger Justiz gegen kreativen Protest für den Erhalt der Lebensgrundlagen.\r\nMemes inklusive. 🧮", "speakers": ["MQAUZD", "NGDXAA"], "track": 7, "start": "2024-12-29T11:00:00+01:00", "end": "2024-12-29T11:40:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.584251+00:00", "state": null, "do_not_record": false}, {"code": "9RPH7S", "id": 2062, "title": "Robot Uprising: a story-driven AI robotics experience", "abstract": "It's the 2040’s. The dusty skyline of Helsinki is covered with vertical buildings reaching for the clouds. Autonomous drones deliver messages and items from layer to layer while robots maintain the aerial pathways across buildings. A sense of tension hangs in the air.\r\n\r\nSomewhere beneath the surface, hackers and corporates wage war over AI. Will they be able to master it, or will the City succumb to a dark technology? \r\n\r\n**Perhaps you can change the fate of things?**", "speakers": ["P7CNUN", "LCUBLG", "FUGRAB"], "track": 1, "start": "2024-12-29T12:00:00+01:00", "end": "2024-12-29T12:40:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.584268+00:00", "state": null, "do_not_record": false}, {"code": "XXXSWE", "id": 2063, "title": "AI Meets Git: Unmasking Security Flaws in Qodo Merge", "abstract": "The whole world is talking about AI, and developers are no exception. When a developer hears about a tool that can help them handle git pull requests using AI, it is likely that they will start using it for their open source project.\r\n\r\nThis is precisely what's happening with Qodo Merge (formerly PR-Agent), an open source tool that can help review and handle git pull requests by using AI to provide feedback and suggestions to developers. It is getting adopted by more and more open source projects, including popular ones.\r\n\r\nIt is so easy to add new features by relying on external tools, yet the consequences on security can be catastrophic.\r\n\r\nIndeed, if the tool contains security vulnerabilities, the project using it may become vulnerable too and may grant anyone permissions to perform unexpected actions without realizing it. But everyone wants to use AI so security may be overlooked.\r\n\r\nWe found multiple vulnerabilities in Qodo Merge that may lead to privilege escalation on Gitlab, getting write access to Github repositories and leaking Github repository secrets. Additionally we found multiple high profile Github repositories using Qodo Merge with a configuration that makes them vulnerable, such as highly popular projects, government official repositories, self-driving automotive industry projects, blockchains and more.\r\n\r\nIn this talk we go through what Qodo Merge is, how it can be used, how it works, how it can be exploited, what projects are affected and what are the impacts. We also mention remediation steps to fix these issues.", "speakers": ["KDJS9U"], "track": 6, "start": "2024-12-29T12:00:00+01:00", "end": "2024-12-29T12:40:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.584284+00:00", "state": null, "do_not_record": false}, {"code": "GAWZXM", "id": 2064, "title": "Von Augustus bis Trump – Warum Desinformation ein Problem bleibt und was wir trotzdem dagegen tun können", "abstract": "Trotz intensiver Forschung hinken wir aktuellen Entwicklungen im Bereich Desinformation oft hinterher. In diesem Vortrag erklären wir, warum der Umgang mit Desinformation so herausfordernd ist und welche konkreten Lösungsansätze es gibt.", "speakers": ["ZVHNMU", "REGBTJ"], "track": 5, "start": "2024-12-29T12:00:00+01:00", "end": "2024-12-29T12:40:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.584300+00:00", "state": null, "do_not_record": false}, {"code": "XBE87S", "id": 2066, "title": "Databroker Files: Wie uns Apps und Datenhändler der Massenüberwachung ausliefern", "abstract": "Databroker verschleudern unsere Daten. Über einen Datenmarktplatz konnten wir 3,6 Milliarden Handy-Standortdaten aus Deutschland ergattern. Darin fanden wir detaillierte Bewegungsprofile, unter anderem von Geheimagent:innen, Soldat:innen und hochrangigen Regierungsbeamt:innen. Hier hört ihr die absurde Geschichte, wie einfach solche Daten zu haben sind, was den zügellosen Datenhandel so gefährlich macht – und wie wir gemeinsam für eine Lösung kämpfen können.", "speakers": ["3UXDLB", "RK8CFH", "VDSX8Y"], "track": 7, "start": "2024-12-29T12:55:00+01:00", "end": "2024-12-29T13:35:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.584333+00:00", "state": null, "do_not_record": false}, {"code": "VY3FKQ", "id": 2067, "title": "Der traurigste Vortrag über digitale Barrierefreiheit des Jahrhunderts", "abstract": "Ein riesiger Teil der digitalen Leistungen der Bundesrepublik sind nicht inklusiv und für alle zugänglich. Eklatante Rechtsbrüche werden ignoriert und es gibt absolut nichts, was wir tun können, außer darüber zu reden.", "speakers": ["MBPMFP"], "track": 7, "start": "2024-12-29T12:55:00+01:00", "end": "2024-12-29T13:35:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.584349+00:00", "state": null, "do_not_record": false}, {"code": "CHDQRA", "id": 2065, "title": "Vom Betrieb bis ins Netz: Gewerkschaften als Vorbild für modernen Widerstand?", "abstract": "Von kreativen Strategien und Herausforderungen aus der Gewerkschaftsarbeit im Kampf für Arbeiter*innenrechte", "speakers": ["Z3PS8T", "R87WNM"], "track": 7, "start": "2024-12-29T12:55:00+01:00", "end": "2024-12-29T13:35:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.584316+00:00", "state": null, "do_not_record": false}, {"code": "GYAZK8", "id": 2070, "title": "Euclid, das Weltraumteleskop - 180 Millionen Galaxien sind ein guter Anfang", "abstract": "„Euclid\" ist seit 2023 das neue Weltraumteleskop der Europäischen Weltraumbehörde mit Beteiligungen eines Wissenschaftskonsortiums aus vierzehn europäischen Ländern, den USA, Kanada und Japan. Gestartet vor knapp eineinhalb Jahren, läuft jetzt seit gut 9 Monaten die wissenschaftliche Himmeldurchmusterung. Auf dem 37C3 konnte ich die ersten fünf \"Early Release Observation\" Bilder vorstellen, seitdem ist viel passiert. Vor allem läuft nach ein paar Anlaufschwierigkeiten die Mission richtig gut und viele hundert Quadratgrad des Himmels sind bereits fertig kartiert - die Datenbearbeitung und Auswertung läuft. Ich werde weitere Bilder und einen kleinen Blick hinter die Kulissen zeigen.", "speakers": ["AGZZLD"], "track": 5, "start": "2024-12-29T13:50:00+01:00", "end": "2024-12-29T14:30:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.584398+00:00", "state": null, "do_not_record": false}, {"code": "PN3TE3", "id": 2069, "title": "Ein unmoralisches Angebot: Wie wir unsere Communities vor ideologischen Zugriffen schützen", "abstract": "In beschleunigten Krisenzeiten wächst mit der Überforderung auch die Sehnsucht nach einer klaren Ordnung: Weltbilder, die das Chaos auf ein moralisch aufgeladenes \"Entweder-Oder\" reduzieren. \r\n\r\nMit dieser binären Logik werden alle Lösungen, die das \"Sowohl-als-auch\" denken, abgemäht. Die verheerende Folge: zwischen aufgeheiztem Lagerdenken, Positionierungsdruck und Rhetorik von individueller Schuld und Scham ist kein kollektives Handeln mehr möglich.\r\n\r\nDer Talk macht das unmoralische Angebot eines universalistischen und anwender*innenfreundlichen „Security-Updates\". Eine Empfehlung, auf was wir dringend achten sollten, um unser Netzwerk handlungsfähig zu halten.", "speakers": ["UE7JGF"], "track": 7, "start": "2024-12-29T13:50:00+01:00", "end": "2024-12-29T14:30:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.584382+00:00", "state": null, "do_not_record": false}, {"code": "7C8KRZ", "id": 2068, "title": "Auracast: Breaking Broadcast LE Audio Before It Hits the Shelves", "abstract": "Auracast, the new Bluetooth LE Broadcast Audio feature has gained some publicity in the last few months. The Bluetooth SIG has been working on the specification of this feature set in the past few years and vendors are only now starting to implement it. Auracast enables broadcasting audio to multiple devices. These broadcasts can also be encrypted. Unfortunately, the security properties of the protocol are vague and insufficient. It has already been shown that these broadcasts can be hijacked by anyone when unencrypted.\r\n\r\nWe explain the state of (in)security of the protocol and add to it by showing that even when encrypted, broadcasts can often be cracked easily. We also show that once equipped with the passcode, attackers can eavesdrop and hijack even encrypted broadcasts. Alongside the talk, we will release our toolkit to brute-force authentication codes, decrypt dumped Auracast streams, and hijack encrypted broadcasts.", "speakers": ["WTMFDB", "CF83N8"], "track": 6, "start": "2024-12-29T13:50:00+01:00", "end": "2024-12-29T14:30:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.584366+00:00", "state": null, "do_not_record": false}, {"code": "PSHBNA", "id": 2071, "title": "Eat the Rich! Die Menschen wollen soziale Sicherheit, aber kriegen „Deutschland den Deutschen“. Holt das Geld bei den Reichen!", "abstract": "Bezahlkarte bald auch für Bürgergeld-Empfänger*innen, verschärfte Sanktionen, Pauschale für die Kosten der Unterkunft, weniger Regelsatz, Umzugszwang, verschärfte Zumutbarkeitsregelungen für Arbeitsangebote und Komplett-Überwachung: Die Debatte über das Bürgergeld ist völlig durchgedreht. Was kommt noch auf uns zu? Und wie kommen wir aus der Hetz-Spirale wieder heraus?", "speakers": ["VV7YBE"], "track": 7, "start": "2024-12-29T14:45:00+01:00", "end": "2024-12-29T15:25:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.584415+00:00", "state": null, "do_not_record": false}, {"code": "KBSSG9", "id": 2073, "title": "Dialing into the Past: RCE via the Fax Machine – Because Why Not?", "abstract": "Remember the days when faxes were the pinnacle of office tech, and the sound of a paper getting pulled in was as satisfying as a fresh cup of coffee? Well, it's time to dust off those memories and reintroduce ourselves to the quirky world of printers and their forgotten fax interfaces – yes, those relics that make us all feel like we're in an '80ies sci-fi movie – and specifically, how they can unlock a new frontier in printer security exploits!", "speakers": ["ZHRT8U", "VVP3K9"], "track": 6, "start": "2024-12-29T14:45:00+01:00", "end": "2024-12-29T15:25:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.584448+00:00", "state": null, "do_not_record": false}, {"code": "UDBPYF", "id": 2072, "title": "The Design Decisions behind the first Open-Everything FABulous FPGA", "abstract": "With the availability of robust silicon-proven open-source tools, IPs, and process design kits (PDKs), it is now possible to build complex chips without industry tools. This is exactly what we did to design our first open-everything FABulous FPGA, which is an example of open silicon that is designed and programmed entirely with open tools.\r\n\r\nProduced in the Skywater 130nm process node, our chip features 672 LUTs (each with 4 inputs and a flop), 6 DSP blocks (8x8 bit multipliers with 20-bit accumulators), 8 BRAMs (with 1KB each), and 12 register file primitives (each having 32 4-bit words with 1 write and 2 read ports). The resources are sufficient to run, for instance, a small RISC-V system on the fabric. The FPGA comes with a small board that is designed to fit into an audio cassette case and that can be programmed directly via an USB interface. Moreover, the FPGA supports partial reconfiguration, which allows us to swap the logic of parts of the FPGA while continuing operation in the rest of the chip.\r\n\r\nThe chip was designed with the help of the versatile FABulous framework, which integrates several further open-source projects, including Yosys, nextpnr, the Verilator, OpenRAM, and the OpenLane tool suite. FABulous was used for various embedded FPGAs, including multiple designs manufactured in the TSMC 28nm process node.\r\n\r\nThe talk will discuss and analyze differences and similarities with industry FPGAs and dive into design decision taken and optimizations applied to deliver good quality of results (with respect to area cost and performance). The talk will highlight state-of-the-art in open-source FPGA chip design and provide a deeper than usual discussion on the design principles of these devices.", "speakers": ["DS3NUS"], "track": 4, "start": "2024-12-29T14:45:00+01:00", "end": "2024-12-29T15:25:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.584432+00:00", "state": null, "do_not_record": false}, {"code": "GNZG8R", "id": 2075, "title": "Let's build dodos! How generative AI is upturning the world of synthetic biology and hopelessly overwhelming traditional governance instruments.", "abstract": "Have you always wanted to build an egg-laying woolly milk sow or bring the legendary dodo \r\nback to life? The dream of some biologists to not only understand organisms, but also to redesign, build or bring living beings back to life is accelerating towards reality with the convergence of synthetic biology and generative AI in ‘generative biology’. For example, large language models are now being used to write genes and proteins, while complex laboratory tests are being replaced by machine vision and automation. \r\nThe pace of these developments is so fast that they are barely noticed by the public, politicians or related experts such as environmental scientists. Questions about the reliability and safety of these new biodigital methods and applications are not yet being asked and research into risk assessment methods is not keeping pace. At the same time, this shift of generative AI systems from generating text and images to generating protein, bacteria, viruses and organisms could transform many areas of life, from medicine and the environment to bioweapons. So let's talk about it and discuss it.", "speakers": ["AWJJK7"], "track": 5, "start": "2024-12-29T15:45:00+01:00", "end": "2024-12-29T16:25:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.584481+00:00", "state": null, "do_not_record": false}, {"code": "YTE8AH", "id": 2074, "title": "Can We Find Beauty in Tax Fraud?", "abstract": "What do Olaf Scholz, blue ikea bags, Moldova, Deutsche Bank, fine art, and Butyrka Prison have in common?\r\n\r\nJoin us for a brief stroll through the hidden, shady world of large-scale tax fraud, cross-border financial crime, money laundering, and corruption. We’ll examine both common and lesser-known financial exploits, drawing on revelations from journalists, activists, and investigators over the last few decades.", "speakers": ["YDKCFR"], "track": 1, "start": "2024-12-29T15:45:00+01:00", "end": "2024-12-29T16:25:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.584465+00:00", "state": null, "do_not_record": false}, {"code": "YC8L8L", "id": 2076, "title": "Beyond BLE: Cracking Open the Black-Box of RF Microcontrollers", "abstract": "Despite the recent popularity and breadth of offerings of low-cost RF microcontrollers, there is a shared absence of documentation for the internal workings of their RF hardware. Vendors might provide an API for their supported protocols, such as BLE, but their documentation will only provide as much detail as necessary to use these libraries. For practically every BLE MCU available to hobbyists, interfacing with the on-chip radio is limited to secret ROMs or binary blobs. In this talk, we will finally peel back the curtain on one of these RF MCUs, giving the ability to understand and unlock the full potential of the hardware to operate in new modes.", "speakers": ["WHX9RN", "WRNFTN"], "track": 4, "start": "2024-12-29T15:45:00+01:00", "end": "2024-12-29T16:25:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.584497+00:00", "state": null, "do_not_record": false}, {"code": "8CZXCG", "id": 2078, "title": "Brauchbare Illegalität – Organisationen für menschenfeindliche Diskurse wappnen", "abstract": "Organisationen und die in ihnen stattfindenden Gespräche und Debatten haben einen großen Einfluss auf ihre Mitglieder und ihr Umfeld. Es ist daher bedeutsam und beunruhigend, wenn in diesen Diskursen Grundsätze unseres gesellschaftlichen Zusammenlebens in Frage gestellt werden. Was tun? \r\n\r\nLuhmanns Begriff der \" Brauchbaren Illegalität \" beschreibt elegant und kraftvoll funktionale Regelabweichungen in Organisationen. In diesem Talk werden ausgehend von diesem Begriff Gestaltungsmöglichkeiten für Strukturen, Praktiken und Hacks vorgestellt. Diese Anregungen zeigen, wie die ausgesprochenen und unausgesprochenen Regeln einer Organisation so verändert werden können, dass sie eine demokratische und fortschrittliche Gesellschaft stärken.", "speakers": ["NRXCHY"], "track": 7, "start": "2024-12-29T16:40:00+01:00", "end": "2024-12-29T17:20:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.584530+00:00", "state": null, "do_not_record": true}, {"code": "7YDWFB", "id": 2077, "title": "Biological evolution: writing, rewriting and breaking the program of life", "abstract": "Biological evolution is a great inventor. Over 4 billion years, it has generated an astonishing diversity of lifeforms, from the tiniest bacteria to the tallest trees.\r\nEach new organism inherits a genetic program from its parents - a set of instructions to “build” the organism itself. Random mutations in this program can alter the organism’s traits, affecting its ability to survive in its environment. \r\nBut how do these small changes combine over thousands of generations to yield the vast complexity we see in present-day lifeforms?\r\n\r\nIn this talk, we discuss examples from our research, using computer simulations to model the early evolution of animals, from single-celled microbes to complex multicellular organisms. \r\nWe show that evolution behaves a bit like a hacker, repurposing the programs it previously built in unexpected ways to create new functions and structures. \r\n\r\nUnderstanding how evolution continually innovates is one of biology’s grand challenges. We also hope that uncovering these processes in biological systems will provide new perspectives on current debates about the generative and creative capabilities of AI.", "speakers": ["WDSHW3", "F38JF3"], "track": 5, "start": "2024-12-29T16:40:00+01:00", "end": "2024-12-29T17:20:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.584514+00:00", "state": null, "do_not_record": false}, {"code": "87CFYP", "id": 2079, "title": "Der Milliarden-Steuerraub Cum/Ex – wie schädlich ist Wirtschaftskriminalität für unsere Gesellschaft?", "abstract": "Nachdem kurz erklärt wird, was Cum/Ex eigentlich ist, widmet sich der Vortrag zunächst der Frage, wie die Aufklärung in diesem international organisierten Fall schwerer Steuerhinterziehung überhaupt gelingen konnte und was noch zu tun ist. Wer sind die Akteure auf Seiten der Finanzbranche und wie ticken die Täter? Anschließend wird der generelle Umgang des Staates mit Wirtschaftskriminalität dargestellt und Lösungsansätze entwickelt. Dabei geht es auch um die Frage, was jeder Einzelne tun kann und warum die NGO Finanzwende ein wichtiger Ort sein kann, um politische Veränderungen bei finanzpolitischen Themen zu bewirken.", "speakers": ["HP9TNF"], "track": 7, "start": "2024-12-29T16:40:00+01:00", "end": "2024-12-29T17:20:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.584546+00:00", "state": null, "do_not_record": false}, {"code": "8UUJVJ", "id": 2080, "title": "KI nach dem Kapitalismus: Hat ChatGPT in der besseren neuen Welt einen Platz?", "abstract": "Unsere Welt funktioniert nur, wenn sich immer neue Bereiche finden, in denen Profite erbeutet werden können. Nach Blockchain, Metaverse und Web3 ist \"Künstliche Intelligenz\" die neueste Wette der Tech-Investoren auf kräftige Gewinne. Ob \"KI\" tatsächlich irgendeinen gesellschaftlichen Wert hat, ist dabei völlig nebensächlich. Was tun wir also mit \"KI\" nach dem Kapitalismus? Brauchen wir Large Language Models überhaupt in einer Welt, die radikal auf Kooperation statt Konkurrenz, auf Bedürfniserfüllung statt Profit und auf Solidarität statt Privateigentum basiert?", "speakers": ["UC99JE", "TSL8NC"], "track": 7, "start": "2024-12-29T17:35:00+01:00", "end": "2024-12-29T18:15:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.584562+00:00", "state": null, "do_not_record": false}, {"code": "H8QNQX", "id": 2081, "title": "High energy physics aside the Large Hadron Collider", "abstract": "What are we, and where do we come from? - Searching for flavour in beauty\r\n\r\nNowadays the Large Hadron Collider (LHC) at CERN is the best known high energy physics research facility. However, there are other facilities around the world performing cutting edge high energy physics research. Some of these are the so called flavour factories which have a long tradition in high energy physics. Two of these are currently in operation: BES III in China and Belle II in Japan. Collecting huge amounts of data, the goal of these experiments is to measure free parameters of the standard model of particle physics with very high precision to find deviations from predictions by theory. Such deviations can hint to new physics, and physicists are still searching for the reasons of our very existence as by our best knowledge nothing but light should have remained after the big bang. But testing the standard model is challenging. Huge data sets in the order of tera bytes need to be analysed requiring advanced analysis software and techniques. By now these analyses usually employ machine learning and artificial intelligence in various kinds, while using custom hardware and software, and a world spanning computing infrastructure. All of this is only possible with more than 1000 people working together in a collaboration. Part of the work in high energy physics nowadays would not be possible anymore without the groundbreaking research by this year's Nobel laureates for physics.\r\nIn this talk I will present what flavour physics is, the reasons why flavour physics is interesting and why it matters, and which challenges we are facing, using the Belle II experiment as an example. Most of the challenges are not unique to Belle II but to high energy physics in general, so I will also set this into the bigger context and take a look to what is ahead of us in the field of high energy physics.", "speakers": ["FBPCUQ"], "track": 5, "start": "2024-12-29T17:35:00+01:00", "end": "2024-12-29T18:15:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.584578+00:00", "state": null, "do_not_record": false}, {"code": "9G97SZ", "id": 2082, "title": "TETRA Algorithm set B - Can glue mend the burst?", "abstract": "In August 2023, we published the TETRA:BURST vulnerabilities - the result of the first public in-depth security analysis of TETRA (Terrestrial Trunked Radio): a European standard for trunked radio globally used by government agencies, police, military, and critical infrastructure. Authentication and encryption within TETRA were handled by proprietary cryptographic cipher-suites, which had remained secret for over two decades through restrictive NDAs until our reverse-engineering and publication.\r\n\r\n\r\nThis talk is not TETRA:BURST, but dives into the latest TETRA revision introduced in 2022. Most notably, it contains a new suite of cryptographic ciphers. Of course the cipher available for critical infrastructure and civilian use (TEA7) is intentionally crippled, and of course these ciphers were to be kept secret, but this decision was overruled due to public backlash following our publication last year. In this talk we will present a practical attack on the TEA7 cipher, which while taking a 192-bit key, only offers 56 bits of security. Furthermore, we point out improvements and shortcomings of the new standard, and present an update on TEA3 cryptanalysis, where we previously found a suspicious feature, and draw a parallel with its successor TEA6.\r\n\r\nAll in all, in this short and relatively crypto-forward talk, we assess with all-new material whether the new TETRA standard is fit for its intended purpose. This crucial technology seeks to once again take a very central role in our society for decades to come, and its cryptographic resilience is of fundamental importance - for emergency networks, but possibly even more for our critical infrastructure and associated processes.", "speakers": ["J8CYTJ", "HD3XAR"], "track": 6, "start": "2024-12-29T17:35:00+01:00", "end": "2024-12-29T18:15:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.584595+00:00", "state": null, "do_not_record": false}, {"id": 2084, "title": {"de": "Pause", "en": "break"}, "start": "2024-12-29T17:15:00Z", "end": "2024-12-29T19:15:00+01:00", "room": 3}, {"id": 2083, "title": {"de": "Pause", "en": "break"}, "start": "2024-12-29T17:15:00Z", "end": "2024-12-29T19:15:00+01:00", "room": 1}, {"id": 2085, "title": {"de": "Pause", "en": "break"}, "start": "2024-12-29T17:15:00Z", "end": "2024-12-29T19:15:00+01:00", "room": 2}, {"code": "XUE8CS", "id": 2086, "title": "Drawing with circuits – creating functional and artistic PCBs together", "abstract": "We are a professional electronics designer and a professional artist. We'd like to share our experience of integrating an artist into the design workflow for EMF's 2022 and 2024 event badges, how we ensured that form and function grew together, and how you might make a board so fancy it crashes your PCB vendor’s CAM software.", "speakers": ["8AGVWP", "RDWW9V"], "track": 1, "start": "2024-12-29T19:15:00+01:00", "end": "2024-12-29T19:55:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.584675+00:00", "state": null, "do_not_record": false}, {"code": "CEJZ9E", "id": 2087, "title": "May the forest be with you – Bäume pflanzen gegen die Klimakrise?", "abstract": "Der Harz wurde von Borkenkäfern gefressen, nur jeder vierte Baum in Deutschland gilt als gesund und in Russland sowie Nordamerika brennen die Wälder in einem enormen Ausmaß. Gleichzeitig gelten Wälder als eine der Lösungen in der Klimakrise, als CO2-Speicher und Produzent von nachhaltigen, nachwachsenden Rohstoffen. Sind Wälder in Gefahr auf Grund von Dürre, Borkenkäfer und Feuer? Und können wir mit Wiederaufforstungen der Klimakrise was entgegensetzten? Kirsten Krüger forscht an der Technischen Universität München zu Störungsdynamiken in Wäldern und erklärt in ihrem Vortrag, was Wälder eigentlich alles für uns leisten, warum Störungen ein natürlicher Bestandteil von Wäldern sind und Bäume pflanzen allein keine akkurate Antwort auf die Klimakrise ist.", "speakers": ["KQNZ3E"], "track": 5, "start": "2024-12-29T19:15:00+01:00", "end": "2024-12-29T19:55:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.584692+00:00", "state": null, "do_not_record": false}, {"code": "99SLE3", "id": 2088, "title": "Knäste hacken", "abstract": "In Deutschland sitzen über 40.000 Menschen im Knast. Weitgehend ohne Zugang zu digitaler Infrastruktur - außer einem Telefon. Wir schauen uns die Systeme an, die sie nutzen dürfen und in denen sie verwaltet werden.", "speakers": ["ZCQ9AQ"], "track": 7, "start": "2024-12-29T19:15:00+01:00", "end": "2024-12-29T19:55:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.584708+00:00", "state": null, "do_not_record": false}, {"code": "UBWU9D", "id": 2091, "title": "Hacking Life: How to decode and manipulate biological cells with AI", "abstract": "AI methods are advancing biological research in diverse directions. In this talk, you will learn how we decode the fundamental building blocks of life with AI, and how it will help us to hack cells to cure diseases and beyond.", "speakers": ["UXM7PK"], "track": 5, "start": "2024-12-29T20:15:00+01:00", "end": "2024-12-29T20:55:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.584757+00:00", "state": null, "do_not_record": false}, {"code": "F7SPPL", "id": 2090, "title": "Das IFG ist tot – Best of Informationsfreiheit, Gefangenenbefreiung & Machtübernahmen", "abstract": "Die Versprechungen waren groß: Blühende Transparenz-Landschaften, Mitbestimmung, Korruptionsprävention, De-mo-kra-tie!\r\nDas Informationsfreiheitsgesetz sollte den deutschen Staat besser machen. Nach Jahren schlechter Verwaltungspraxis, schlechter Gerichtsurteile und schlechter Politik ist es in wichtigen Teilen aber nutzlos geworden. Das zeigt sich vor allem, wenn man sich Szenarien einer antidemokratischen Regierungsübernahme vorstellt - die Transparenz wäre als erstes hinüber, der Boden dafür ist schon bereit.\r\nWas tun?", "speakers": ["ESSJ93"], "track": 7, "start": "2024-12-29T20:15:00+01:00", "end": "2024-12-29T20:55:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.584741+00:00", "state": null, "do_not_record": false}, {"code": "STEVPR", "id": 2089, "title": "Ultrawide archaeology on Android native libraries", "abstract": "A bug in a scraper script led to us downloading every single native library in every single Android app ever published in any market (~8 million apps). \r\nInstead of deleting this massive dataset and starting again, we foolishly decided to run some binary similarity algos to check if libraries and outdated and still vulnerable to old CVEs. No one told us we were opening Pandora's box.\r\nA tragic story of scraping, IP-banning circumvention, love/hate relationships with machine learning, binary similarity party tricks, and an infinite sea of vulnerabilities.", "speakers": ["VWTJFD", "JHCRTT"], "track": 6, "start": "2024-12-29T20:15:00+01:00", "end": "2024-12-29T20:55:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.584724+00:00", "state": null, "do_not_record": false}, {"code": "LVVRLL", "id": 2094, "title": "Klimaschädlich by Design – die ökologischen Kosten des KI-Hypes", "abstract": "Sogenannte Generative KI hat einen hohen Rechenbedarf und braucht damit automatisch viel Energie. Wir wollen zeigen, was die AI-Bubble uns alle bisher an Ressourcen gekostet hat. Wer verdient sich daran dumm und dusslig? Und wer trägt die ökologischen und sozialen Kosten?", "speakers": ["LRVD9D", "FCLVFD"], "track": 7, "start": "2024-12-29T21:10:00+01:00", "end": "2024-12-29T21:50:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.584806+00:00", "state": null, "do_not_record": false}, {"code": "N3FZQD", "id": 2092, "title": "Postpartum Punk: make space for unfiltered creativity", "abstract": "After years as a journalist and filmmaker covering topics like crypto, holocaust and showbiz, everything changed for me 3 years ago after the birth of my daughter. \r\n\r\nWhile I haven't planned to be a mother, I decided to keep this pregnancy at 41, however this grass turn out to be too high for lawn mower – I was ready to go for a rave, not to be locked in a baby dark room for 3 years. \r\n\r\nI felt like my brain had been reprogrammed overnight. The analytical mindset I once relied on—quick to analyse, explore, and understand complex topics—seemed to vanish, replaced by a simpler, instinct-driven state that prioritized pure survival and nurturing yet mixed with unhinged chaos, aux naturelle psychedelic downloads plus no sense of inhibition or fear of being seen. \r\n\r\nHand cuffed to a rainbow I was gazing at the black clouds. \r\n\r\nDespite the shock at this involuntarily IQ transplant, I quickly realised this new mind-tool-set was all in all fulfilling and liberating.\r\n\r\nI became my own fire brigade with an alternative emergency strap-on.\r\n\r\nWithout the pressure to think analytically, I began channelling this raw energy into my joke band PUShY PUShY PUShY, creating what I now call postpartum punk movement. \r\n\r\nThe idea caught on – this summer we have been featured in the Guardian and The New Yorker. \r\n\r\nThis fuels my missionarism towards another level: how can we embrace this wild, intuitive mindset, not only as parents but as people? And could new technologies help us experience or even learn from this state?", "speakers": ["Z3KHUM"], "track": 1, "start": "2024-12-29T21:10:00+01:00", "end": "2024-12-29T21:50:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.584773+00:00", "state": null, "do_not_record": false}, {"code": "TKWN7X", "id": 2093, "title": "Die Elektronische Patientenakte (ePA)– a legal instruction trap?", "abstract": "Kaum ein IT-Gesundheitsprojekt bleibt so hinter den Erwartungen und Versprechen zurück wie die Elektronische Patientenakte (ePA). Sie wird in 2025 zur Pflicht. \r\nJede gesetzlich versicherte Person die nicht widerspricht, bekommt eine mit Abrechnungsdaten befüllte ePA kostenlos. Da nichts kostenlos ist, bist Du auch in diesem Fall nicht Kunde sondern Ware und bezahlst bestenfalls nur mit Deinen Daten …", "speakers": ["3JUULQ"], "track": 7, "start": "2024-12-29T21:10:00+01:00", "end": "2024-12-29T21:50:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.584790+00:00", "state": null, "do_not_record": true}, {"code": "ZJFPSS", "id": 2097, "title": "Hacker's Guide to Meshtastic: Off-Grid, Encrypted LoRa Meshnets for Cheap!", "abstract": "Beginners can now create off-grid, encrypted mesh networks for cheap, with applications in emergency communication, sensor monitoring, and more! These mesh networks have been popping up in cities all over the world, and this talk will go over everything a beginner needs to run or build their own nodes.", "speakers": ["KWEG8C"], "track": 4, "start": "2024-12-29T22:05:00+01:00", "end": "2024-12-29T22:45:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.584856+00:00", "state": null, "do_not_record": false}, {"code": "JLJGB8", "id": 2095, "title": "Mushroom-DJs, Strong AI & Climate Change: Connecting the Dots with Artistic Research", "abstract": "The exploratory nature of artistic research can aide in the production of knowledge. Sometimes, this takes a detour through music-making mushrooms and making moonshine, sometimes it deals with societal reverberations of AI usage or how lithium extraction affects the planet. This talk gives an insight on how we do technology-assisted artistic research at ZKM | Hertzlab, the artistic research & development department of the Center for Art and Media, Karlsruhe.", "speakers": ["7UES7S"], "track": 1, "start": "2024-12-29T22:05:00+01:00", "end": "2024-12-29T22:45:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.584823+00:00", "state": null, "do_not_record": false}, {"code": "9SSMGL", "id": 2098, "title": "Attack Mining: How to use distributed sensors to identify and take down adversaries", "abstract": "Ever wondered why your web server seems to be under constant attack from what feels like everyone on the internet?\r\nMe too!\r\nJoin me in this session where we'll explore the data of millions of attacks from hundreds of sensors around the world, to identify who is attacking us from where and why. Additionally, we will have a look into how we can use that data to get abusive systems taken down, and how successful this approach actually is.\r\n\r\nBuckle up for a deep dive into the constant battle to protect systems on the internet against adversaries gaining access, and how you can help make the internet a safer place!", "speakers": ["XSCPP9"], "track": 6, "start": "2024-12-29T23:00:00+01:00", "end": "2024-12-30T00:00:00+01:00", "room": 2, "duration": 60, "updated": "2024-12-22T10:54:37.584872+00:00", "state": null, "do_not_record": false}, {"code": "UR9CYP", "id": 2099, "title": "How election software can fail", "abstract": "Experiences from a hacker working at the Election Council of The Netherlands.", "speakers": ["Y3FF8T"], "track": 6, "start": "2024-12-29T23:00:00+01:00", "end": "2024-12-30T00:00:00+01:00", "room": 3, "duration": 60, "updated": "2024-12-22T10:54:37.584889+00:00", "state": null, "do_not_record": false}, {"code": "NA9SF8", "id": 2100, "title": "Pyrotechnik – ist doch kein Verbrechen!?", "abstract": "Feuerwerk erregt die Gemüter - und das seit mehreren hundert Jahren. Gemeinsam beleuchten wir technische, kulturelle und gesellschaftspolitische Aspekte eines der faszinierenderen und gleichermaßen umstritteneren Phänomene unserer Zeit.", "speakers": ["AFAGHN", "WCRMDZ"], "track": 4, "start": "2024-12-29T23:00:00+01:00", "end": "2024-12-30T00:00:00+01:00", "room": 1, "duration": 60, "updated": "2024-12-22T17:23:38.941909+00:00", "state": null, "do_not_record": true}, {"code": "M733LV", "id": 2102, "title": "Hacking Victorian Bodies: From Grid to Vector Space", "abstract": "This performative lecture by SOLID FLESH Collective explores how generative AI can reshape historical body representations into tools for imagining new bodily futures. Drawing from Muybridge’s chronophotography, which fixed bodies into a rigid scientific grid, we investigate AI’s capacity for fluid, multidimensional embodiment. Using open-source AI models to ‘resurrect’ Muybridge’s subjects and defy commercial censorship, we reveal speculative possibilities for bodily motion and identity. Our work positions the ‘vector body’—a digitally-mediated form of self-imagination—within a broader conversation on identity fluidity, algorithmic embodiment, and liberating futures beyond conventional body ideals.", "speakers": ["9KFENC"], "track": 1, "start": "2024-12-30T00:15:00+01:00", "end": "2024-12-30T00:55:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.584937+00:00", "state": null, "do_not_record": false}, {"code": "8C7KKR", "id": 2101, "title": "Hacker Jeopardy", "abstract": "The Hacker Jeopardy is a quiz show.", "speakers": ["RGAFL8", "7SALSZ"], "track": 3, "start": "2024-12-30T00:15:00+01:00", "end": "2024-12-30T02:15:00+01:00", "room": 1, "duration": 120, "updated": "2024-12-22T10:54:37.584921+00:00", "state": null, "do_not_record": false}, {"code": "WDCRSE", "id": 2010, "title": "Mal was mit Holz", "abstract": "Bildervortrag zum Thema \"Nachhaltige Inneneinrichtung\" mit Mitbringseln zum Anfassen sowie Tipps & Tricks zu Konstruktion, Gestaltung und Durchführung", "speakers": ["BUTKGY"], "track": 4, "start": "2024-12-30T00:15:00+01:00", "end": "2024-12-30T00:55:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-23T20:57:36.238831+00:00", "state": null, "do_not_record": false}, {"id": 2106, "title": {"de": "Testbild", "en": "test image"}, "start": "2024-12-30T01:15:00Z", "end": "2024-12-30T11:00:00+01:00", "room": 2}, {"id": 2105, "title": {"de": "Testbild", "en": "test image"}, "start": "2024-12-30T01:15:00Z", "end": "2024-12-30T11:00:00+01:00", "room": 3}, {"id": 2104, "title": {"de": "Testbild", "en": "test image"}, "start": "2024-12-30T01:15:00Z", "end": "2024-12-30T11:00:00+01:00", "room": 1}, {"code": "MCGKUA", "id": 2107, "title": "From Simulation to Tenant Takeover", "abstract": "All I wanted was for Microsoft to deliver my phishing simulation. This journey took me from discovering trivial vulnerabilities in Microsoft's Attack Simulation platform, to a Chinese company to which Microsoft outsourced its support department that wanted all my access tokens. I finally ended up hijacking remote PowerShell sessions and obtaining all data from random Microsoft 365 tenants, all the while reeling in bug bounties along the way.", "speakers": ["A3WAHW"], "track": 6, "start": "2024-12-30T11:00:00+01:00", "end": "2024-12-30T11:40:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.585031+00:00", "state": null, "do_not_record": false}, {"code": "PEN9QU", "id": 2108, "title": "Dude, Where's My Crypto? - Real World Impact of Weak Cryptocurrency Keys", "abstract": "We present Milksad, our research on a class of vulnerabilities that exposed over a billion dollars worth of cryptocurrency to anyone willing to 'crunch the numbers'.\r\nThe fatal flaw? Not enough chaos.\r\nLearn how we found and disclosed issues in affected open source wallet software, brute-forced thousands of individual affected wallets on a budget, and traced over a billion US dollars worth of prior transactions through them.", "speakers": ["9PCECD"], "track": 6, "start": "2024-12-30T11:00:00+01:00", "end": "2024-12-30T11:40:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.585048+00:00", "state": null, "do_not_record": false}, {"code": "RWD9LP", "id": 2109, "title": "Longtermismus – der „Geist“ des digitalen Kapitalismus", "abstract": "Der Vortrag wirft einen sozialwissenschaftlichen Blick auf die Ideologie des Longtermismus. Seine Funktion im digitalen Kapitalismus wird analysiert. Mithilfe von Klassikern der Soziologie wird dargestellt, warum sich diese Ideologie in eine faschistische Richtung entwickelt.", "speakers": ["8PXKCG"], "track": 7, "start": "2024-12-30T11:00:00+01:00", "end": "2024-12-30T11:40:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.585064+00:00", "state": null, "do_not_record": false}, {"code": "33YLTY", "id": 2112, "title": "Ten Years of Rowhammer: A Retrospect (and Path to the Future)", "abstract": "The density of memory cells in modern DRAM is so high that disturbance errors, like the Rowhammer effect, have become quite frequent. An attacker can exploit Rowhammer to flip bits in inaccessible memory locations by reading the contents of nearby accessible memory rows. Since its discovery in 2014, we have seen a cat-and-mouse security game with a continuous stream of new attacks and new defenses. Now, in 2024, exactly 10 years after Rowhammer was discovered, it is time to look back and reflect on the progress we have made and give an outlook on the future. Additionally, we will present an open-source framework to check if your system is vulnerable to Rowhammer.", "speakers": ["TFXR7B", "MAEMK9", "USSKAN"], "track": 6, "start": "2024-12-30T12:00:00+01:00", "end": "2024-12-30T12:40:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.585113+00:00", "state": null, "do_not_record": false}, {"code": "BQFULL", "id": 2110, "title": "Is Green Methanol the missing piece for the Energy Transition?", "abstract": "In an accelerating climate crisis, renewable energy and electrification are the most important tools to reduce greenhouse gas emissions. However, in sectors where electrification is infeasible or impossible, other solutions will be needed. While hydrogen gets a lot of attention, it suffers from challenges like being difficult to transport and store. While it does not receive nearly as much attention as hydrogen, another molecule, methanol, could play a crucial role in bringing down emissions in challenging sectors like shipping, aviation, or the chemical industry.", "speakers": ["FNVHRM"], "track": 5, "start": "2024-12-30T12:00:00+01:00", "end": "2024-12-30T12:40:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.585081+00:00", "state": null, "do_not_record": false}, {"code": "HFPUYT", "id": 2111, "title": "Moving with feelings: Behind the scenes of a one man show mobile & fiber operator in Spain", "abstract": "How to run an MVNO with values: What are the requirements? Do you need a government license, maybe a lot of investment? There are different types of MVNOs. We will talk about how to do business as an MVNO while respecting users' privacy, supporting free software, believing in the right to repair and making your customers technologically sovereign.", "speakers": ["SQRWTM"], "track": 4, "start": "2024-12-30T12:00:00+01:00", "end": "2024-12-30T12:40:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.585097+00:00", "state": null, "do_not_record": false}, {"code": "NJXH8N", "id": 2114, "title": "All Brains are Beautiful! – The Biology of Neurodiversity", "abstract": "How do you think?\r\nPeople can experience thoughts, feelings, and sensory inputs very differently. While context and substances are known to promote changes in perception and thinking, the biological basis is very diverse, contrary to what is often assumed. Brain cells come in extraordinary varieties in size, shape, and complexity. Their synaptic connectivity provides the foundation of all our sensory input, motor output, cognitive functions, and thoughts. In short: They shape us. This talk gives an introduction about the extent of variability in neuronal patterns that underlies neurodiversity and critically discusses the idea of neurodivergence, diagnosis criteria in Autism and ADHD from a biological and first person-perspective. We find that biological variability of brains is an evolutionary feature that helps us to adapt to our environment but comes with certain risks and downsides in our modern society. While many things are still unknown, scientists have identified genes and environmental impacts that shape our network architecture during brain development and which help to explain why we think and experience the world so differently.", "speakers": ["N9FSAE"], "track": 5, "start": "2024-12-30T12:55:00+01:00", "end": "2024-12-30T13:35:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.585145+00:00", "state": null, "do_not_record": false}, {"code": "WCUKHB", "id": 2113, "title": "Going Long! Sending weird signals over long haul optical networks", "abstract": "Computer network operators depend on optical transmission everywhere as it is what glues together our interconnected world. But most of the industry is running the same kinds of signals down the optical transceivers.\r\n\r\nAs part of my need to \"Trust, but verify\" I wanted to check my assumptions on how the business end of modern optical modules worked, so join me in a adventure of sending weird signals many kilometres, and maybe set some records for the most wasteful bandwidth utilisation of optical spectrum in 2024!", "speakers": ["JNVZWK"], "track": 4, "start": "2024-12-30T12:55:00+01:00", "end": "2024-12-30T13:35:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.585129+00:00", "state": null, "do_not_record": false}, {"code": "WU87FV", "id": 2115, "title": "GLAM zwischen LOD und ¯\\_(ツ)_/¯. Museumskritik für Hacker*innen", "abstract": "Habt ihr euch immer schon gefragt wie Museumssammlungen ins Netz kommen, warum online Sammlungen meist immer noch aussehen wie Kataloge seit dem 19. Jahrhundert, was für Strategien und Förderprogramme dahinter stecken, welche Firmen hier quasi-Monopole haben, und warum Museen so viele Hoffnungen (Zugang! Partizipation! Demokratie!) mit der Digitalisierung verbinden? Der Talk ist eine Einladung an Hacker*innen sich an der kritischen Weiterentwicklung, Öffnung und Reflexion von Museen zu beteiligen.", "speakers": ["GGV7QP"], "track": 5, "start": "2024-12-30T12:55:00+01:00", "end": "2024-12-30T13:35:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.585161+00:00", "state": null, "do_not_record": false}, {"code": "YLNEYH", "id": 2116, "title": "From Convenience to Contagion: The Libarchive Vulnerabilities Lurking in Windows 11", "abstract": "In the October 2023 update, Windows 11 introduced support for 11 additional compression formats, including RAR and 7z, allowing users to manage these types of files natively within File Explorer. The enhancement significantly improves convenience; however, it also introduces potential security risks. To support these various compression formats, Windows 11 utilizes the libarchive library, a well-established open-source library used across multiple operating systems like Linux, BSD, and macOS, and in major projects such as ClickHouse, Homebrew, and Osquery.\r\n\r\nThe libarchive has been continuously fuzzed by Google’s OSS-Fuzz project, making it a time-tested library. However, its coverage in OSS-Fuzz has been less than ideal. In addition to the two remote code execution (RCE) vulnerabilities disclosed by Microsoft Offensive Research & Security Engineering (MORSE) in January, we have identified several vulnerabilities in libarchive through code review and fuzzing. These include a heap buffer overflow vulnerability in the RAR decompression and arbitrary file write and delete vulnerabilities due to insufficient checks of libarchive’s output on Windows. Additionally, in our presentation, we will reveal several interesting features that emerged from the integration of libarchive with Windows.\r\n\r\nAnd whenever vulnerabilities are discovered in widely-used libraries like libarchive, their risks often permeate every corner, making it difficult to estimate the potential hazards. Moreover, when Microsoft patches Windows, the corresponding fixes are not immediately merged into libarchive. This delay gives attackers the opportunity to exploit other projects using libarchive. For example, the vulnerabilities patched by Microsoft in January were not merged into libarchive until May, leaving countless applications exposed to risk for four months. The worst part is that the developers might not know the vulnerability details or even be aware of its existence. To illustrate this situation, we will use the vulnerabilities we reported to ClickHouse as an example to demonstrate how attackers can exploit the vulnerabilities while libarchive remains unpatched.", "speakers": ["FBPUQB"], "track": 6, "start": "2024-12-30T13:50:00+01:00", "end": "2024-12-30T14:30:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.585177+00:00", "state": null, "do_not_record": false}, {"code": "F7MSNF", "id": 2117, "title": "Microbes vs. Mars: A Hacker's Guide to Finding Alien Life", "abstract": "Mars is famously the only planet (we know of) that is entirely inhabited by robots. And these robots are working hard on looking for something that would be one of the most significant discoveries in the history of science: Alien life.\r\nBut how do you look for something that no one has ever seen? And would we recognize it if we find it?\r\nJoin me on a journey through Mars’ ancient past and Earth’s most extreme environments, where scientists hunt for strange microbes that defy all our expectations: Organisms thriving in salt lakes, breathing metal, and building bizarre microbial ‘cities’ out of rock. Are they the blueprint of what alien life might look like? I will introduce you to the cutting-edge technology we use to analyse and understand them, and how we detect their “biological fingerprints” that might one day help us to find Martian life.\r\nThis talk will not only give you a deep look behind the scenes of the search for life on Mars, but also a new appreciation for the strange and wonderful life on our own planet.", "speakers": ["CWESVP"], "track": 5, "start": "2024-12-30T13:50:00+01:00", "end": "2024-12-30T14:30:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.585194+00:00", "state": null, "do_not_record": false}, {"code": "3QG7TT", "id": 2118, "title": "identity theft, credit card fraud and cloaking services – how state-sponsored propaganda makes use of the cyber criminal toolbox", "abstract": "The Russian disinformation campaign Doppelgänger is considered to be technically highly sophisticated. Research by CORRECTIV and Qurium has revealed that the Russian state relies on the toolbox of internet fraudsters for the dissemination of propaganda and fakes. A talk on the state's possible alliance with the criminal world - and on possibilities and limitations of countering it.", "speakers": ["X8XC9U", "G8LSV9"], "track": 7, "start": "2024-12-30T13:50:00+01:00", "end": "2024-12-30T14:30:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.585211+00:00", "state": null, "do_not_record": false}, {"code": "PRLP7M", "id": 2121, "title": "Von Ionen zu Daten: Die Funktionsweise und Relevanz von (Quadrupol-)Massenspektrometern", "abstract": "Massenspektrometer sind unverzichtbare Analysewerkzeuge in der Chemie und zudem hochinteressante und verblüffende Instrumente. In diesem Talk wird die Massenspektrometrie mit Schwerpunkt auf Quadrupolmassenspektrometer anschaulich vorgestellt.", "speakers": ["YWVC3N"], "track": 5, "start": "2024-12-30T14:45:00+01:00", "end": "2024-12-30T15:25:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.585259+00:00", "state": null, "do_not_record": false}, {"code": "EAT3WZ", "id": 2120, "title": "Find My * 101", "abstract": "I'll introduce the technology underlying bluetooth trackers from Apple and Google, and will describe and show what can actually be seen on the air (using a hackrf/rad1o for example).\r\n\r\nThis is part demonstration of what is possible right now, part explanation of the underlying principles, and part invitation to would-be hackers to make creative use of this technology.", "speakers": ["GD9SLR"], "track": 6, "start": "2024-12-30T14:45:00+01:00", "end": "2024-12-30T15:25:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.585244+00:00", "state": null, "do_not_record": false}, {"code": "WHDXXH", "id": 2119, "title": "corebooting Intel-based systems", "abstract": "Gaining a reasonable level of trust on the firmware that runs your everyday activities", "speakers": ["MYCBTQ", "HYRZNP"], "track": 4, "start": "2024-12-30T14:45:00+01:00", "end": "2024-12-30T15:25:00+01:00", "room": 2, "duration": 40, "updated": "2024-12-22T10:54:37.585227+00:00", "state": null, "do_not_record": false}, {"code": "DFATXZ", "id": 2122, "title": "Philosophical, Ethical and Legal Aspects of Brain-Computer Interfaces", "abstract": "This talk examines philosophical, legal, and ethical questions of the merging of human minds with intelligent machines through Brain-Computer-Interfaces, provides an overview of current debates and international regulatory development - and what might be at stake when technologies increasingly access the human brain.", "speakers": ["U8PMTD"], "track": 5, "start": "2024-12-30T15:45:00+01:00", "end": "2024-12-30T16:25:00+01:00", "room": 3, "duration": 40, "updated": "2024-12-22T10:54:37.585275+00:00", "state": null, "do_not_record": false}, {"code": "MHXP8Q", "id": 2123, "title": "Implantable Cardiac Devices - Security and Data Accessibility", "abstract": "Cardiac Implantable Electronic Devices (CIED), such as cardiac pacemakers and defibrillators, are a fairly niche target for security researchers, in part due to a lack of manufacturer cooperation and device accessibility. This talk aims to provide insights into the challenges in device development and methods with which to research device security. Data accessibility to patients will be touched upon.", "speakers": ["U9HCFM"], "track": 4, "start": "2024-12-30T15:45:00+01:00", "end": "2024-12-30T16:25:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.585292+00:00", "state": null, "do_not_record": false}, {"code": "SDFDUW", "id": 2124, "title": "Security Nightmares", "abstract": "Der IT-Sicherheitsalptraum-Rück­blick: Manchmal belustigend, zuweilen beunruhigend, aber mit Ausblick.", "speakers": ["SQZYBX", "FCLVFD"], "track": 2, "start": "2024-12-30T16:40:00+01:00", "end": "2024-12-30T17:40:00+01:00", "room": 1, "duration": 60, "updated": "2024-12-22T10:54:37.585307+00:00", "state": null, "do_not_record": false}, {"code": "XKW9LG", "id": 2126, "title": "38C3: Infrastructure Review", "abstract": "This talks gives a behind the scenes on how the infrastructure side of the event is done.", "speakers": ["9BBUNY"], "track": 2, "start": "2024-12-30T16:40:00+01:00", "end": "2024-12-30T17:55:00+01:00", "room": 3, "duration": 75, "updated": "2024-12-22T10:54:37.585339+00:00", "state": null, "do_not_record": false}, {"code": "VZCYSX", "id": 2127, "title": "38C3: Return to legal constructions", "abstract": "Let's join in a quiet moment to bid farewell to the chaotic wonderland that has been 38C3 and prepare ourselves for the harsh reality outside.", "speakers": ["GLM7BA", "SB9MER"], "track": 2, "start": "2024-12-30T18:00:00+01:00", "end": "2024-12-30T18:40:00+01:00", "room": 1, "duration": 40, "updated": "2024-12-22T10:54:37.585355+00:00", "state": null, "do_not_record": false}], "version": "1.0", "timezone": "Europe/Berlin", "event_start": "2024-12-27", "event_end": "2024-12-30", "tracks": [{"id": 1, "name": {"de": "Art & Beauty", "en": "Art & Beauty"}, "description": {}, "color": "#F9B000"}, {"id": 2, "name": {"de": "CCC", "en": "CCC"}, "description": {}, "color": "#F2F006"}, {"id": 3, "name": {"de": "Entertainment", "en": "Entertainment"}, "description": {}, "color": "#4D4D4C"}, {"id": 4, "name": {"de": "Hardware & Making", "en": "Hardware & Making"}, "description": {}, "color": "#685B9D"}, {"id": 5, "name": {"de": "Science", "en": "Science"}, "description": {}, "color": "#00A356"}, {"id": 6, "name": {"de": "Security", "en": "Security"}, "description": {}, "color": "#0347B4"}, {"id": 7, "name": {"de": "Ethics, Society & Politics", "en": "Ethics, Society & Politics"}, "description": {}, "color": "#E40429"}], "rooms": [{"id": 1, "name": {"de": "Saal 1", "en": "Saal 1"}, "description": {"de": "Vortragssaal in CCH Mitte, 2. bis 4. OG", "en": "Lecture hall in CCH central, Level +2 to +4"}}, {"id": 3, "name": {"de": "Saal GLITCH", "en": "Saal GLITCH"}, "description": {"de": "Vortragssaal G in CCH Mitte, 2. OG", "en": "Lecture hall G in CCH West, Level +2"}}, {"id": 2, "name": {"de": "Saal ZIGZAG", "en": "Saal ZIGZAG"}, "description": {"de": "Vortragssaal Z in CCH Ost, 3. OG", "en": "Lecture hall Z in CCH East, Level +3"}}], "speakers": [{"code": "VJ3ZVS", "name": "erdgeist", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Dirk_QW8E006.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Dirk_QW8E006_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Dirk_QW8E006_thumbnail_tiny.jpg"}, {"code": "GD9SLR", "name": "Henryk Plötz", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/HP_Photo_45596_P4WOkbS.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/HP_Photo_45596_P4WOkbS_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/HP_Photo_45596_P4WOkbS_thumbnail_tiny.jpg"}, {"code": "Z7NCVT", "name": "Stefanie Wuschitz", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "H9GEPE", "name": "khaleesi", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/H9GEPE_SrtQiP3.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/H9GEPE_SrtQiP3_thumbnail_default_AX76559.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/H9GEPE_SrtQiP3_thumbnail_tiny_wmCisUd.jpg"}, {"code": "UKSDRS", "name": "Stefan Magerstedt", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "ESSJ93", "name": "Arne Semsrott", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/ESSJ93_bAbp1JW.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/ESSJ93_bAbp1JW_thumbnail_default_0GtiR31.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/ESSJ93_bAbp1JW_thumbnail_tiny_PtZ6BOW.jpg"}, {"code": "DWMZX3", "name": "Ange Albertini", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/261a01e1b07b7387b0d675322199fb58_4p9330g.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/261a01e1b07b7387b0d675322199fb58_4p9330g_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/261a01e1b07b7387b0d675322199fb58_4p9330g_thumbnail_tiny.jpg"}, {"code": "WTMFDB", "name": "Frieder Steinmetz", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "PYGMMA", "name": "Sebastian Neef (gehaxelt)", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/me-fotograf-2023_f6ukcEN.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/me-fotograf-2023_f6ukcEN_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/me-fotograf-2023_f6ukcEN_thumbnail_tiny.jpg"}, {"code": "EHYBMZ", "name": "Raquel Renno Nunes", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Raquel-5_it0HK05.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Raquel-5_it0HK05_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Raquel-5_it0HK05_thumbnail_tiny.jpg"}, {"code": "RLPKN8", "name": "Andrew 'bunnie' Huang", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/bunnie-avatar2_jfcttmh.png", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/bunnie-avatar2_jfcttmh_thumbnail_default.png", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/bunnie-avatar2_jfcttmh_thumbnail_tiny.png"}, {"code": "CTUZKV", "name": "Sebastian \"Schw4rz\" Schwarz", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/CTUZKV_q240tlm.png", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/CTUZKV_q240tlm_thumbnail_default_qr30Jyf.png", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/CTUZKV_q240tlm_thumbnail_tiny_seTn1yC.png"}, {"code": "MYCBTQ", "name": "aprl", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/photo_2024-08-02_10-33-50_07vmxu8.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/photo_2024-08-02_10-33-50_07vmxu8_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/photo_2024-08-02_10-33-50_07vmxu8_thumbnail_tiny.jpg"}, {"code": "YPVSCL", "name": "Frank van der Linde", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/20221218_142112_ud4tRBb.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/20221218_142112_ud4tRBb_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/20221218_142112_ud4tRBb_thumbnail_tiny.jpg"}, {"code": "XGHZ8X", "name": "Aline Sylla", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/XGHZ8X_cZfkGRs.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/XGHZ8X_cZfkGRs_thumbnail_default_U5Uf4k5.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/XGHZ8X_cZfkGRs_thumbnail_tiny.jpg"}, {"code": "Y3FF8T", "name": "Benjamin W. Broersma", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/e578e9b6a68ecc195bcfd5762d9f2c36_Xru8hjF.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/e578e9b6a68ecc195bcfd5762d9f2c36_Xru8hjF_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/e578e9b6a68ecc195bcfd5762d9f2c36_Xru8hjF_thumbnail_tiny.jpg"}, {"code": "8AGVWP", "name": "Kliment", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "ULFQKZ", "name": "Anja Lehmann", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "AWJJK7", "name": "Margret Engelhard", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IMG_9991aaa_wz44lMH.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IMG_9991aaa_wz44lMH_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IMG_9991aaa_wz44lMH_thumbnail_tiny.jpg"}, {"code": "ZERVKP", "name": "Wanda", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/ZERVKP_i00v6wA.png", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/ZERVKP_i00v6wA_thumbnail_default_UCDTG6L.png", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/ZERVKP_i00v6wA_thumbnail_tiny.png"}, {"code": "GSQXZS", "name": "stacksmashing", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/eVa9IMdD_400x400_CoIsLDO.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/eVa9IMdD_400x400_CoIsLDO_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/eVa9IMdD_400x400_CoIsLDO_thumbnail_tiny.jpg"}, {"code": "GATV3V", "name": "DorotaC", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/index_pmO2MZV.png", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/index_pmO2MZV_thumbnail_default.png", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/index_pmO2MZV_thumbnail_tiny.png"}, {"code": "SQZYBX", "name": "Ron", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "LCUBLG", "name": "Katarina Partti", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "VDSX8Y", "name": "Rebecca Ciesielski", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "K3ZGYZ", "name": "Matthias Frielingsdorf", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IMG_7432_rT69hO2.jpeg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IMG_7432_rT69hO2_thumbnail_default.jpeg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IMG_7432_rT69hO2_thumbnail_tiny.jpeg"}, {"code": "J9SHZR", "name": "Anne Roth", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/facepalm3-300_Q2kBWrw.png", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/facepalm3-300_Q2kBWrw_thumbnail_default.png", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/facepalm3-300_Q2kBWrw_thumbnail_tiny.png"}, {"code": "CYESEX", "name": "Niklas Roy a.k.a. royrobotiks", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/CYESEX_xZV1GN4.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/CYESEX_xZV1GN4_thumbnail_default_bM30BXl.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/CYESEX_xZV1GN4_thumbnail_tiny.jpg"}, {"code": "KQQQXV", "name": "Arne Vogelgesang", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "ZSAGCE", "name": "Christian Lölkes", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/dbcc6942dc04d7eb9174ec70cc494ee2_tCZ2KJh.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/dbcc6942dc04d7eb9174ec70cc494ee2_tCZ2KJh_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/dbcc6942dc04d7eb9174ec70cc494ee2_tCZ2KJh_thumbnail_tiny.jpg"}, {"code": "78TDA9", "name": "Marte Henningsen", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Polish_20241022_110637396_Eq7ZTIZ.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Polish_20241022_110637396_Eq7ZTIZ_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Polish_20241022_110637396_Eq7ZTIZ_thumbnail_tiny.jpg"}, {"code": "CWESVP", "name": "Anouk Ehreiser", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Field_pic_VquR0Wi.jpeg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Field_pic_VquR0Wi_thumbnail_default.jpeg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Field_pic_VquR0Wi_thumbnail_tiny.jpeg"}, {"code": "9KFENC", "name": "Marcin Ratajczyk", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/24.10.20_basel_selfie_2_VqhQKpB.png", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/24.10.20_basel_selfie_2_VqhQKpB_thumbnail_default.png", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/24.10.20_basel_selfie_2_VqhQKpB_thumbnail_tiny.png"}, {"code": "AMFQL7", "name": "Jean Peters", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/images_1_olhKuUr.jpeg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/images_1_olhKuUr_thumbnail_default.jpeg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/images_1_olhKuUr_thumbnail_tiny.jpeg"}, {"code": "KQNZ3E", "name": "Kirsten Krüger", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Profile_image_Q6mz40b.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Profile_image_Q6mz40b_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Profile_image_Q6mz40b_thumbnail_tiny.jpg"}, {"code": "EHRJTA", "name": "Aedan Cullen", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/23391273_SrdWNeR.png", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/23391273_SrdWNeR_thumbnail_default.png", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/23391273_SrdWNeR_thumbnail_tiny.png"}, {"code": "U9HCFM", "name": "dilucide", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "HYRZNP", "name": "elly", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "MLSWTE", "name": "Kaspar", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "DS3NUS", "name": "Dirk", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Electronics-for-dogs-174x209_7S7zNGn.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Electronics-for-dogs-174x209_7S7zNGn_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Electronics-for-dogs-174x209_7S7zNGn_thumbnail_tiny.jpg"}, {"code": "YWVC3N", "name": "Sally", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/sally_2e216hG.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/sally_2e216hG_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/sally_2e216hG_thumbnail_tiny.jpg"}, {"code": "3JUULQ", "name": "cbro", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "SQ39BW", "name": "erlern", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IMG_20240715_173612_9OlFOGF.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IMG_20240715_173612_9OlFOGF_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IMG_20240715_173612_9OlFOGF_thumbnail_tiny.jpg"}, {"code": "MF7ZLU", "name": "anna", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "UGMN7G", "name": "Apostolis Fotiadis", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "WHX9RN", "name": "Adam Batori", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "R8JSW9", "name": "Sean \"xobs\" Cross", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "FDYRKA", "name": "Ting-Chun Liu", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/myface_2_BdZ9pNb.JPG", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/myface_2_BdZ9pNb_thumbnail_default.JPG", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/myface_2_BdZ9pNb_thumbnail_tiny.JPG"}, {"code": "MZXSRS", "name": "Linus Neumann", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/MZXSRS_q7shHYJ.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/MZXSRS_q7shHYJ_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/MZXSRS_q7shHYJ_thumbnail_tiny.jpg"}, {"code": "AGZZLD", "name": "Knud Jahnke", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/jahnke_knud_portrait_2021-04-29_Uu1z8Qy.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/jahnke_knud_portrait_2021-04-29_Uu1z8Qy_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/jahnke_knud_portrait_2021-04-29_Uu1z8Qy_thumbnail_tiny.jpg"}, {"code": "AFAGHN", "name": "felix", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "URY3ED", "name": "Joscha Bach", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IMG_1023_7pdYEHJ.jpeg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IMG_1023_7pdYEHJ_thumbnail_default.jpeg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IMG_1023_7pdYEHJ_thumbnail_tiny.jpeg"}, {"code": "ZVHNMU", "name": "Hendrik Heuer", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/csm_h_heuer_ifib_3315fd43c3_BgoW9IG.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/csm_h_heuer_ifib_3315fd43c3_BgoW9IG_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/csm_h_heuer_ifib_3315fd43c3_BgoW9IG_thumbnail_tiny.jpg"}, {"code": "MQAUZD", "name": "Samuel Bosch", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/photo_2021-04-02_12-37-53_ZBj3rcl.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/photo_2021-04-02_12-37-53_ZBj3rcl_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/photo_2021-04-02_12-37-53_ZBj3rcl_thumbnail_tiny.jpg"}, {"code": "QZDXQZ", "name": "Martin Tschirsich", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/QZDXQZ_ieMwIcb.png", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/QZDXQZ_ieMwIcb_thumbnail_default_g2f7nuh.png", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/QZDXQZ_ieMwIcb_thumbnail_tiny.png"}, {"code": "SEHVM7", "name": "Leon-Etienne Kühr", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/photo_2024-10-27_00-03-33_nBMazKU.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/photo_2024-10-27_00-03-33_nBMazKU_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/photo_2024-10-27_00-03-33_nBMazKU_thumbnail_tiny.jpg"}, {"code": "7XJF99", "name": "Johannes Bernstein", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "WDSHW3", "name": "Enrico Sandro Colizzi", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Colizzi_GtTQtRQ.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Colizzi_GtTQtRQ_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Colizzi_GtTQtRQ_thumbnail_tiny.jpg"}, {"code": "F38JF3", "name": "Renske Vroomans", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Renske_newpic_kcaNokb.png", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Renske_newpic_kcaNokb_thumbnail_default.png", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Renske_newpic_kcaNokb_thumbnail_tiny.png"}, {"code": "FBPCUQ", "name": "Christian Wessel", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "3UXDLB", "name": "Sebastian Meineck", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Sebastian-Meineck_Credit_Philipp-Sipos_cKzUgM8.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Sebastian-Meineck_Credit_Philipp-Sipos_cKzUgM8_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Sebastian-Meineck_Credit_Philipp-Sipos_cKzUgM8_thumbnail_tiny.jpg"}, {"code": "ZHRT8U", "name": "Rick de Jager", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/rick_l57aAmY.jpeg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/rick_l57aAmY_thumbnail_default.jpeg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/rick_l57aAmY_thumbnail_tiny.jpeg"}, {"code": "UX9KST", "name": "Thomas Lohninger", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/job_pic_EaKs4jW.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/job_pic_EaKs4jW_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/job_pic_EaKs4jW_thumbnail_tiny.jpg"}, {"code": "ELFVJX", "name": "kathia", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IMAG0022_n6t0OwM.JPG", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IMAG0022_n6t0OwM_thumbnail_default.JPG", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IMAG0022_n6t0OwM_thumbnail_tiny.JPG"}, {"code": "Z3PS8T", "name": "Joana Starck", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/photo_2024-10-27_00-43-57_5Tz8GEu.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/photo_2024-10-27_00-43-57_5Tz8GEu_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/photo_2024-10-27_00-43-57_5Tz8GEu_thumbnail_tiny.jpg"}, {"code": "GM3CMB", "name": "Theo Döllmann", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/McToel_Avatar_ijLqKoa.png", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/McToel_Avatar_ijLqKoa_thumbnail_default.png", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/McToel_Avatar_ijLqKoa_thumbnail_tiny.png"}, {"code": "SLT3Y8", "name": "Adam M.", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "3GWP8N", "name": "Lukas Stennes", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/3GWP8N_z7iKkZb.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/3GWP8N_z7iKkZb_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/3GWP8N_z7iKkZb_thumbnail_tiny.jpg"}, {"code": "R8CWZD", "name": "kleinsophie", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "WRNFTN", "name": "Robert Pafford", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "RGAFL8", "name": "Sec", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/RGAFL8_vO1Mwxe.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/RGAFL8_vO1Mwxe_thumbnail_default.jpg", "avatar_thumbnail_tiny": null}, {"code": "UC99JE", "name": "Malte Engeler", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Profilbild2024-6_r2ETAuy.jpeg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Profilbild2024-6_r2ETAuy_thumbnail_default.jpeg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Profilbild2024-6_r2ETAuy_thumbnail_tiny.jpeg"}, {"code": "NWUNRH", "name": "Chris Köver", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Portrat_400x400_ahqbjj8.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Portrat_400x400_ahqbjj8_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Portrat_400x400_ahqbjj8_thumbnail_tiny.jpg"}, {"code": "KBTVLY", "name": "Ciljeta Bajrami", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "TSUD8L", "name": "Svea Eckert", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Svea_Eckert_1_BY1u8x8.jpeg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Svea_Eckert_1_BY1u8x8_thumbnail_default.jpeg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Svea_Eckert_1_BY1u8x8_thumbnail_tiny.jpeg"}, {"code": "JHCRTT", "name": "Rokhaya Fall", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "NGDXAA", "name": "Kiki Köffle", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "EEB9SH", "name": "Nicolas Oberli", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "XSCPP9", "name": "Lars König", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/XSCPP9_xq7s8nM.jpeg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/XSCPP9_xq7s8nM_thumbnail_default_5STdbgg.jpeg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/XSCPP9_xq7s8nM_thumbnail_tiny.jpeg"}, {"code": "XXQZRD", "name": "Kai Biermann", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/portrait-jim-norris-pie-town-1940_miDQefJ.jpeg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/portrait-jim-norris-pie-town-1940_miDQefJ_thumbnail_default.jpeg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/portrait-jim-norris-pie-town-1940_miDQefJ_thumbnail_tiny.jpeg"}, {"code": "REGBTJ", "name": "Josephine Schmitt", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "FVHASV", "name": "Meredith Whittaker", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Florian_Hetz_DSC4833_copy_zMVmILN.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Florian_Hetz_DSC4833_copy_zMVmILN_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Florian_Hetz_DSC4833_copy_zMVmILN_thumbnail_tiny.jpg"}, {"code": "FUGRAB", "name": "Juho Kostet", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "FBPUQB", "name": "NiNi Chen", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/15998206_9xDWEgk.png", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/15998206_9xDWEgk_thumbnail_default.png", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/15998206_9xDWEgk_thumbnail_tiny.png"}, {"code": "ZCQ9AQ", "name": "Lilith Wittmann", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "BU8FCC", "name": "Patrícia J. Reis", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/BU8FCC_aT7cpcz.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/BU8FCC_aT7cpcz_thumbnail_default_GFOjVOU.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/BU8FCC_aT7cpcz_thumbnail_tiny.jpg"}, {"code": "G3KGDZ", "name": "schneider", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/icon-crop_nFy5FTk_zannp3i.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/icon-crop_nFy5FTk_zannp3i_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/icon-crop_nFy5FTk_zannp3i_thumbnail_tiny.jpg"}, {"code": "C87MMB", "name": "Fabian Bräunlein", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/fb_X2TBBIC.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/fb_X2TBBIC_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/fb_X2TBBIC_thumbnail_tiny.jpg"}, {"code": "MSVAFM", "name": "Luca Melette", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/lm_rb_zSY8K4X.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/lm_rb_zSY8K4X_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/lm_rb_zSY8K4X_thumbnail_tiny.jpg"}, {"code": "BTRVPF", "name": "Rainer Rehak", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/WI_Dach_Rehak_only_GTf2OQ0.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/WI_Dach_Rehak_only_GTf2OQ0_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/WI_Dach_Rehak_only_GTf2OQ0_thumbnail_tiny_Cp7eXmc.jpg"}, {"code": "SQRWTM", "name": "Edgar Saumell Oechsle", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "7SALSZ", "name": "Ray", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "8JXB8Y", "name": "neobrain", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/991f6fc4e925ac4a_gfvoAWJ.png", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/991f6fc4e925ac4a_gfvoAWJ_thumbnail_default.png", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/991f6fc4e925ac4a_gfvoAWJ_thumbnail_tiny.png"}, {"code": "GLM7BA", "name": "Senficon", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/felix_2024_quadrat_g2i2mMI.png", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/felix_2024_quadrat_g2i2mMI_thumbnail_default.png", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/felix_2024_quadrat_g2i2mMI_thumbnail_tiny_XM9DELY.png"}, {"code": "JVBQBW", "name": "Fefe", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "3B83Y7", "name": "Peli Grietzer", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "GUJ79K", "name": "Joschua Knüppe", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "NFKBFE", "name": "Atoth", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "NRXCHY", "name": "Johannes Fertmann", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "DBCLFN", "name": "Artur Neufeld", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "8W79RK", "name": "Frostie314159", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/8W79RK_qOe1MxU.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/8W79RK_qOe1MxU_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/8W79RK_qOe1MxU_thumbnail_tiny.jpg"}, {"code": "RDWW9V", "name": "Morag Hickman", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Avocado_wobbler_eVoaUfC.gif", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Avocado_wobbler_eVoaUfC_thumbnail_default.gif", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Avocado_wobbler_eVoaUfC_thumbnail_tiny.gif"}, {"code": "TSL8NC", "name": "Sandra Sieron", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "MU3XPH", "name": "Dr. Carsten Adrian", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/MU3XPH_mNvGzt1.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/MU3XPH_mNvGzt1_thumbnail_default_h3BpM9z.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/MU3XPH_mNvGzt1_thumbnail_tiny.jpg"}, {"code": "8PXKCG", "name": "Max Franz Johann Schnetker", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "WCRMDZ", "name": "bijan", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/WCRMDZ_XXLeAqC.jpeg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/WCRMDZ_XXLeAqC_thumbnail_default_3Ydd8NI.jpeg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/WCRMDZ_XXLeAqC_thumbnail_tiny.jpeg"}, {"code": "88EWDM", "name": "Kris Shrishak", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "RACQPP", "name": "Gunther", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "USSKAN", "name": "Florian Adamsky", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/ich-round-avatar_P80F54Q.png", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/ich-round-avatar_P80F54Q_thumbnail_default.png", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/ich-round-avatar_P80F54Q_thumbnail_tiny.png"}, {"code": "TFXR7B", "name": "Daniel Gruss", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/portrait_small_rPT8mpS.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/portrait_small_rPT8mpS_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/portrait_small_rPT8mpS_thumbnail_tiny.jpg"}, {"code": "QHMATE", "name": "Andrei Molodkin", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "HP9TNF", "name": "Anne Brorhilker", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "MAEMK9", "name": "Martin Heckel", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/MAEMK9_PWbhLo2.png", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/MAEMK9_PWbhLo2_thumbnail_default_PJrWDUg.png", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/MAEMK9_PWbhLo2_thumbnail_tiny.png"}, {"code": "R87WNM", "name": "Laurent Kuffert", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/R87WNM_bcwzRP7.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/R87WNM_bcwzRP7_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/R87WNM_bcwzRP7_thumbnail_tiny.jpg"}, {"code": "TEQMJJ", "name": "Manawyrm", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/frame_30_delay-0.04s_K1Ed1DG.gif", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/frame_30_delay-0.04s_K1Ed1DG_thumbnail_default.gif", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/frame_30_delay-0.04s_K1Ed1DG_thumbnail_tiny.gif"}, {"code": "HD3XAR", "name": "Jos Wetzels", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/jos_narrow_85M0EH0.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/jos_narrow_85M0EH0_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/jos_narrow_85M0EH0_thumbnail_tiny.jpg"}, {"code": "VVP3K9", "name": "Carlo Meijer", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "X8A9J9", "name": "lizvlx (UBERMORGEN)", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "UE7JGF", "name": "elenos", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Elenos_Team_jt3uOXv.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Elenos_Team_jt3uOXv_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Elenos_Team_jt3uOXv_thumbnail_tiny.jpg"}, {"code": "EDLBKY", "name": "Wawan", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "BUTKGY", "name": "Metal_Warrior", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "JNVZWK", "name": "Ben Cartwright-Cox", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "RK8CFH", "name": "Ingo Dachwitz", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/RK8CFH_wUvjQZ3.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/RK8CFH_wUvjQZ3_thumbnail_default_n2ZVUHE.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/RK8CFH_wUvjQZ3_thumbnail_tiny.jpg"}, {"code": "GN8CRZ", "name": "Hannah Ruschemeier", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "A3WAHW", "name": "Vaisha Bernard", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/vaisha_blackwhite_McIai0E.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/vaisha_blackwhite_McIai0E_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/vaisha_blackwhite_McIai0E_thumbnail_tiny.jpg"}, {"code": "7STKW8", "name": "Florian Hantke", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/e612c7f0-7d5c-4d03-b9f0-ab8a140d6aaa_TU6ytMy.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/e612c7f0-7d5c-4d03-b9f0-ab8a140d6aaa_TU6ytMy_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/e612c7f0-7d5c-4d03-b9f0-ab8a140d6aaa_TU6ytMy_thumbnail_tiny.jpg"}, {"code": "VCSD3Y", "name": "Nephthys", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "3KYFVK", "name": "Thorsten Schröder", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "U7VYJQ", "name": "Rainer Mühlhoff", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/rainer-neu-mod600-cropped2_EzEbuhi.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/rainer-neu-mod600-cropped2_EzEbuhi_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/rainer-neu-mod600-cropped2_EzEbuhi_thumbnail_tiny.jpg"}, {"code": "VWTJFD", "name": "Luca Di Bartolomeo (cyanpencil)", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "HEDDSQ", "name": "Hiro", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "P7CNUN", "name": "Karim Hamdi", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/P7CNUN_kjG7cKj.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/P7CNUN_kjG7cKj_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/P7CNUN_kjG7cKj_thumbnail_tiny.jpg"}, {"code": "U8PMTD", "name": "Christoph Bublitz", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "JZLQSQ", "name": "Vivian Kube", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "EZWH9S", "name": "Gus", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "9BBUNY", "name": "nicoduck", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "HSY7UP", "name": "Vera Magali Keller", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/HSY7UP_vY6rJN5.png", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/HSY7UP_vY6rJN5_thumbnail_default_oyqWJGU.png", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/HSY7UP_vY6rJN5_thumbnail_tiny.png"}, {"code": "A7TWWU", "name": "Dr. Mixæl Swan Laufer", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/mixael-laufer-hcpp-web_lEVo11B.png", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/mixael-laufer-hcpp-web_lEVo11B_thumbnail_default.png", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/mixael-laufer-hcpp-web_lEVo11B_thumbnail_tiny.png"}, {"code": "9YS9EC", "name": "Michał Kowalczyk", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/polaroid_cropped_gc75ji1.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/polaroid_cropped_gc75ji1_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/polaroid_cropped_gc75ji1_thumbnail_tiny.jpg"}, {"code": "HXHJSY", "name": "moritz simon geist", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/52988197007_9c6e44063c_o_SzGuECu.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/52988197007_9c6e44063c_o_SzGuECu_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/52988197007_9c6e44063c_o_SzGuECu_thumbnail_tiny.jpg"}, {"code": "QN9XMB", "name": "q3k", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/QN9XMB_kKKOw1h.png", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/QN9XMB_kKKOw1h_thumbnail_default_zap0cVi.png", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/QN9XMB_kKKOw1h_thumbnail_tiny.png"}, {"code": "LBUJDK", "name": "Harald Welte", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "9PCECD", "name": "John Naulty", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/il-postino_u8OTvGo.jpeg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/il-postino_u8OTvGo_thumbnail_default.jpeg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/il-postino_u8OTvGo_thumbnail_tiny.jpeg"}, {"code": "7B9PTJ", "name": "PistonMiner", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/7B9PTJ_fvsiTJP.png", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/7B9PTJ_fvsiTJP_thumbnail_default_Brpr70o.png", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/7B9PTJ_fvsiTJP_thumbnail_tiny.png"}, {"code": "RMY3D3", "name": "Jürgen Bering", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "KDJS9U", "name": "Nils Amiet", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "MDQNUH", "name": "Prof. Dr. Dennis-Kenji Kipker", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Dennis-Kenji_Kipker_Urban_Zintel_Photography_Berlin_CaZkDTp.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Dennis-Kenji_Kipker_Urban_Zintel_Photography_Berlin_CaZkDTp_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Dennis-Kenji_Kipker_Urban_Zintel_Photography_Berlin_CaZkDTp_thumbnail_tiny.jpg"}, {"code": "FNVHRM", "name": "Hanno Böck", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/hanno-bild_QUFusvU.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/hanno-bild_QUFusvU_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/hanno-bild_QUFusvU_thumbnail_tiny.jpg"}, {"code": "TXJYNQ", "name": "Sebastian Jünemann", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IMG_5166_ucXYA0F.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IMG_5166_ucXYA0F_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IMG_5166_ucXYA0F_thumbnail_tiny.jpg"}, {"code": "97WZA7", "name": "Lori", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Gravatar_pic_xRrYBr1.png", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Gravatar_pic_xRrYBr1_thumbnail_default.png", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Gravatar_pic_xRrYBr1_thumbnail_tiny.png"}, {"code": "LRVD9D", "name": "Friederike Karla Hildebrandt", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/photo_5366549009604394935_y_U3hE4p4.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/photo_5366549009604394935_y_U3hE4p4_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/photo_5366549009604394935_y_U3hE4p4_thumbnail_tiny.jpg"}, {"code": "7JAN8U", "name": "Anna-Lea Göhl", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "FVQTWA", "name": "Arianna Mondin", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "XENBAM", "name": "Jakub Stepniewicz", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "LPFEDA", "name": "Matthias Marx", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/LPFEDA_mRCsHkm.jpeg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/LPFEDA_mRCsHkm_thumbnail_default.jpeg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/LPFEDA_mRCsHkm_thumbnail_tiny.jpeg"}, {"code": "CF83N8", "name": "Dennis Heinze", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "VV7YBE", "name": "Helena Steinhaus", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Helena_Steinhaus_C._Stollwerk_pFSdP55.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Helena_Steinhaus_C._Stollwerk_pFSdP55_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Helena_Steinhaus_C._Stollwerk_pFSdP55_thumbnail_tiny.jpg"}, {"code": "MBPMFP", "name": "Casey Kreer", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "MD7VMQ", "name": "Jyn", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "X8XC9U", "name": "Alexej Hock", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "CDBGNV", "name": "Jurre van Bergen", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/jurre_pLaTXea.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/jurre_pLaTXea_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/jurre_pLaTXea_thumbnail_tiny.jpg"}, {"code": "L9VTYA", "name": "Daichi Shimabukuro", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Hans_wyDO1nx.png", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Hans_wyDO1nx_thumbnail_default.png", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Hans_wyDO1nx_thumbnail_tiny.png"}, {"code": "SUNSUE", "name": "Anja Höfner", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/SUNSUE_m9pYrkj.jpeg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/SUNSUE_m9pYrkj_thumbnail_default_D8YJcKO.jpeg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/SUNSUE_m9pYrkj_thumbnail_tiny_aqtdZeJ.jpeg"}, {"code": "VEYXPB", "name": "Jasper Devreker", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "MHLNJ7", "name": "Bianca Kastl", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/MHLNJ7_njA787L.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/MHLNJ7_njA787L_thumbnail_default_sg0OwgZ.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/MHLNJ7_njA787L_thumbnail_tiny.jpg"}, {"code": "TVMJBS", "name": "segher", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "HR8WJ8", "name": "Katharina Nocun", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/katta_aluhut_klein-673x1024_XPSqPqC.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/katta_aluhut_klein-673x1024_XPSqPqC_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/katta_aluhut_klein-673x1024_XPSqPqC_thumbnail_tiny.jpg"}, {"code": "YDKCFR", "name": "martin", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "GJAZWP", "name": "Luce deLire", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "D7MTME", "name": "Senana", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/sketches_BxJdaYF.jpeg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/sketches_BxJdaYF_thumbnail_default.jpeg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/sketches_BxJdaYF_thumbnail_tiny.jpeg"}, {"code": "QZX9CY", "name": "Thorsten Hellert", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "VSZDUH", "name": "Hafid Shaaib", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "Z3KHUM", "name": "Ania Poullain-Majchrzak", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IMG_2445_VXnV7Fd.jpeg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IMG_2445_VXnV7Fd_thumbnail_default.jpeg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IMG_2445_VXnV7Fd_thumbnail_tiny.jpeg"}, {"code": "FCLVFD", "name": "Constanze Kurz", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/ich-7-2_8SjCXsu.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/ich-7-2_8SjCXsu_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/ich-7-2_8SjCXsu_thumbnail_tiny.jpg"}, {"code": "SB9MER", "name": "Gabriela Bogk", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/SB9MER_Hwgr1fW.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/SB9MER_Hwgr1fW_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/SB9MER_Hwgr1fW_thumbnail_tiny.jpg"}, {"code": "N9FSAE", "name": "Marcello", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "Y8GPFY", "name": "giulioz", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/profile_square_fZr5F9k.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/profile_square_fZr5F9k_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/profile_square_fZr5F9k_thumbnail_tiny.jpg"}, {"code": "KWEG8C", "name": "Kody Kinzie", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Screenshot_2024-10-25_at_11.40.54_PM_Imqtdqg.png", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Screenshot_2024-10-25_at_11.40.54_PM_Imqtdqg_thumbnail_default.png", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/Screenshot_2024-10-25_at_11.40.54_PM_Imqtdqg_thumbnail_tiny.png"}, {"code": "UXM7PK", "name": "Moritz Schaefer", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/UXM7PK_4xBkbhO.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/UXM7PK_4xBkbhO_thumbnail_default_LMPujwR.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/UXM7PK_4xBkbhO_thumbnail_tiny_g7nnh3P.jpg"}, {"code": "CFNRMP", "name": "Luzius Bernhard", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/UBERPortrait_pmsyfz6.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/UBERPortrait_pmsyfz6_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/UBERPortrait_pmsyfz6_thumbnail_tiny.jpg"}, {"code": "YXXND7", "name": "Manthos Papamatthaiou", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/621eaec1e4e758389a1c8b6ec60f8ce6_F8TGMLK.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/621eaec1e4e758389a1c8b6ec60f8ce6_F8TGMLK_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/621eaec1e4e758389a1c8b6ec60f8ce6_F8TGMLK_thumbnail_tiny.jpg"}, {"code": "7UES7S", "name": "twena", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IMG_20231213_134941_edit_497964803900577_T5Rykj4.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IMG_20231213_134941_edit_497964803900577_T5Rykj4_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IMG_20231213_134941_edit_497964803900577_T5Rykj4_thumbnail_tiny.jpg"}, {"code": "KBR8ZP", "name": "Paul Koetter", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/dithered-4_T4REw2M.png", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/dithered-4_T4REw2M_thumbnail_default.png", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/dithered-4_T4REw2M_thumbnail_tiny.png"}, {"code": "J8CYTJ", "name": "Wouter Bokslag", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/wouter_narrow_lowres_RIxPfIc.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/wouter_narrow_lowres_RIxPfIc_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/wouter_narrow_lowres_RIxPfIc_thumbnail_tiny.jpg"}, {"code": "GGV7QP", "name": "Lukas Fuchsgruber", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "RLN8QE", "name": "Erisvision", "avatar": "", "avatar_thumbnail_default": "", "avatar_thumbnail_tiny": ""}, {"code": "UARYFS", "name": "Ioana Vreme Moser", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IoanaVremeMoserportrait_goK0qjd.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IoanaVremeMoserportrait_goK0qjd_thumbnail_default.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/IoanaVremeMoserportrait_goK0qjd_thumbnail_tiny.jpg"}, {"code": "G8LSV9", "name": "Max Bernhard", "avatar": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/G8LSV9_BQpjbyP.jpg", "avatar_thumbnail_default": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/G8LSV9_BQpjbyP_thumbnail_default_UrNArW7.jpg", "avatar_thumbnail_tiny": "https://fahrplan.events.ccc.de/congress/2024/fahrplan/media/avatars/G8LSV9_BQpjbyP_thumbnail_tiny.jpg"}]}